85hzc/ask_433/stm32f1/Src/App.c
/**
  ******************************************************************************
  * File Name          : App.c
  * Description        : Application file for gesture control
  ******************************************************************************
  *Author:  JL
  *Date:    2019/1/18
  ******************************************************************************
  **/
  
#include "main.h"  
#include "stm32f1xx_hal.h"
#include "I2C.h"
#include "App.h"
#include "stdio.h"
#include "arm_math.h"
#include "arm_const_structs.h"
#include "siliconSi115x.h"

extern volatile uint16_t I2C_SDA_PIN;
extern volatile uint16_t I2C_SCL_PIN;

extern TIM_HandleTypeDef htim3;
uint8_t                  lighting_switch,lighting_status_now;
int16_t                  brightness, brightness_original = 0;
static uint32_t          tickstart;
uint64_t                 sys_tick=0;          //系统tick计数
gs_struct                gs={0};
uint16_t                 led_counter=0;
static uint8_t           overflow_time = 0;
static uint8_t           firstboot=true;

gs_comb_struct           comb_ges;
ADJUST_E                 adjust_type;

void init_counter(void)
{
    LOG_DEBUG("init_counter\r\n");

    gs.hold_flag=false;
    gs.hold_counter=0;
    gs.approach_counter=0;
    gs.leave_counter=0;
    gs.new_hold_AorL_size = GES_SAMPLE_RAW_ARRAY_NUM_L;
}

//变量初始化
void App_Var_Init(void)
{
    //gs.sample_counter=0;
    //gs.sample_ready_flag=0;
    //gs.sample_start_flag=0;
    //gs.sample_frequency=SAMPLE_FREQUENCY_DEF;
    gs.sample_size=GES_SAMPLE_ARRAY_NUM_S;
    gs.sample_size_raw=GES_SAMPLE_RAW_ARRAY_NUM_S;
    gs.new_hold_AorL_size = GES_SAMPLE_RAW_ARRAY_NUM_L;

    for (uint8_t i=0;i<GES_CHN_NUM;i++)
    {
        gs.sample_down_limit[i]=SAMPLE_DOWN_LIMIT_DEF;
        gs.sample_up_limit[i]=SAMPLE_UP_LIMIT_DEF;
    }

    memset(&comb_ges, 0, sizeof(gs_comb_struct));
}

//应用初始化
void App_Init(void)
{
    //uint16_t read_val;
    //uint8_t res;

    //ON lighting
    adjust_type = ADJUST_INIT;
    lighting_switch = 1;
    lighting_status_now = 0;
    brightness = 250+STEP;
    brightness_original = 0;

    App_Var_Init();

    tickstart = HAL_GetTick();
    while((HAL_GetTick() - tickstart) <= 200)//delay
        ;

#if(SENSOR3==1)
    I2C_SDA_PIN = SDA1_Pin;
    I2C_SCL_PIN = SCL1_Pin;
    I2C_init();
    DEMO_Init();
    I2C_SDA_PIN = SDA2_Pin;
    I2C_SCL_PIN = SCL2_Pin;
    I2C_init();
    DEMO_Init();
    I2C_SDA_PIN = SDA3_Pin;
    I2C_SCL_PIN = SCL3_Pin;
    I2C_init();
    DEMO_Init();
#else
    I2C_SDA_PIN = SDA3_Pin;
    I2C_SCL_PIN = SCL3_Pin;
    I2C_init();
    DEMO_Init();
#endif
    LOG_DEBUG("App_Init!\r\n");
    
    //res=VCNL4035_ReadData(VCNL4035_ID,&read_val);
    //LOG_DEBUG("Read res: %d, ID: 0x%04x\n",res,read_val);

    //VCNL4035_InitGesMode();
}

void LED_Tick_Check(void)
{
    if (led_counter)
    {
        led_counter--;
        if (!led_counter)
        {
            HAL_GPIO_WritePin(LED_LEFT_GPIO_Port, LED_LEFT_Pin, GPIO_PIN_SET);
            HAL_GPIO_WritePin(LED_RIGHT_GPIO_Port, LED_RIGHT_Pin, GPIO_PIN_SET);
            HAL_GPIO_WritePin(LED_UP_GPIO_Port, LED_UP_Pin, GPIO_PIN_SET);
            HAL_GPIO_WritePin(LED_DOWN_GPIO_Port, LED_DOWN_Pin, GPIO_PIN_SET);
            HAL_GPIO_WritePin(LED_DCLK_GPIO_Port, LED_DCLK_Pin, GPIO_PIN_SET);
        }
    }
}

//检测start开始标志
uint8_t Ges_Start_Detect(uint16_t *ps)
{
    if(ps[GES_CHN_DOWN_RIGHT]>gs.sample_base_last[GES_CHN_DOWN_RIGHT] && (ps[GES_CHN_DOWN_RIGHT]-gs.sample_base_last[GES_CHN_DOWN_RIGHT]>SAMPLE_DOWN_LIMIT_DEF))
    {
        gs.ges_dynamic_start_chn = GES_CHN_DOWN_RIGHT;
        gs.sample_mode = POSITIVE;
        return true;
    }
#if CHN3_GES
    else if(ps[GES_CHN_UP]>gs.sample_base_last[GES_CHN_UP] && (ps[GES_CHN_UP]-gs.sample_base_last[GES_CHN_UP]>SAMPLE_DOWN_LIMIT_DEF))
    {
        gs.ges_dynamic_start_chn = GES_CHN_UP;
        gs.sample_mode = POSITIVE;
        return true;
    }
#endif
    else if(ps[GES_CHN_DOWN_LEFT]>gs.sample_base_last[GES_CHN_DOWN_LEFT] && (ps[GES_CHN_DOWN_LEFT]-gs.sample_base_last[GES_CHN_DOWN_LEFT]>SAMPLE_DOWN_LIMIT_DEF))
    {
        gs.ges_dynamic_start_chn = GES_CHN_DOWN_LEFT;
        gs.sample_mode = POSITIVE;
        return true;
    }
    else if(ps[GES_CHN_DOWN_RIGHT]<gs.sample_base_last[GES_CHN_DOWN_RIGHT] && (gs.sample_base_last[GES_CHN_DOWN_RIGHT]-ps[GES_CHN_DOWN_RIGHT]>SAMPLE_DOWN_LIMIT_DEF))
    {
        gs.ges_dynamic_start_chn = GES_CHN_DOWN_RIGHT;
        gs.sample_mode = NEGATIVE;
        return true;
    }
#if CHN3_GES
    else if(ps[GES_CHN_UP]<gs.sample_base_last[GES_CHN_UP] && (gs.sample_base_last[GES_CHN_UP]-ps[GES_CHN_UP]>SAMPLE_DOWN_LIMIT_DEF))
    {
        gs.ges_dynamic_start_chn = GES_CHN_UP;
        gs.sample_mode = NEGATIVE;
        return true;
    }
#endif
    else if(ps[GES_CHN_DOWN_LEFT]<gs.sample_base_last[GES_CHN_DOWN_LEFT] && (gs.sample_base_last[GES_CHN_DOWN_LEFT]-ps[GES_CHN_DOWN_LEFT]>SAMPLE_DOWN_LIMIT_DEF))
    {
        gs.ges_dynamic_start_chn = GES_CHN_DOWN_LEFT;
        gs.sample_mode = NEGATIVE;
        return true;
    }
    gs.ges_dynamic_start_chn = GES_CHN_INVALID;
    return false;
}

//检测stop开始标志
uint8_t Ges_Stop_Detect(uint16_t *ps)
{
    if((ps[0]>gs.sample_base_last[0] && (ps[0]-gs.sample_base_last[0]<SAMPLE_DOWN_LIMIT_DEF)) && 
#if CHN3_GES
        (ps[2]>gs.sample_base_last[2] && (ps[2]-gs.sample_base_last[2]<SAMPLE_DOWN_LIMIT_DEF)) && 
#endif
        (ps[1]>gs.sample_base_last[1] && (ps[1]-gs.sample_base_last[1]<SAMPLE_DOWN_LIMIT_DEF)))
    {
        return true;
    }
    else if((ps[0]<gs.sample_base_last[0] && (gs.sample_base_last[0]-ps[0]<SAMPLE_DOWN_LIMIT_DEF)) && 
#if CHN3_GES
        (ps[2]<gs.sample_base_last[2] && (gs.sample_base_last[2]-ps[2]<SAMPLE_DOWN_LIMIT_DEF)) && 
#endif
        (ps[1]<gs.sample_base_last[1] && (gs.sample_base_last[1]-ps[1]<SAMPLE_DOWN_LIMIT_DEF)))
    {
        return true;
    }
    return false;
}

//加入一次采样值
//输入：     ps->读取的采样值数组
//返回：     0-->数组未填充完毕
//          1-->数组已填充完毕
uint8_t Ges_Add_Sample(uint16_t *ps)
{
    uint8_t i,j,k;
    uint32_t sum;
    uint8_t ges_sample_raw_cur_temp;

    for (i=0;i<GES_CHN_NUM;i++)
    {
        ges_sample_raw_cur_temp=gs.ges_sample_raw_cur;
        gs.ges_sample_raw_array[i][ges_sample_raw_cur_temp]=ps[i];
        ges_sample_raw_cur_temp++;
        //raw数组已填充完毕
        if (ges_sample_raw_cur_temp==8)
        {
            for (k=0;k<gs.sample_size;k++)
            {
                for (j=0,sum=0;j<GES_SAMPLE_AVE_NUM;j++)
                {
                    sum+=gs.ges_sample_raw_array[i][k*GES_SAMPLE_AVE_NUM+j];
                }
                gs.ges_sample_array[i][k]=(uint16_t)(sum/GES_SAMPLE_AVE_NUM);
            }
            //LOG_DEBUG("Ges_Add_Sample ch[%d].\r\n",i);
        }
    }
    //在每一帧的开始记录时间
    if (gs.ges_sample_raw_cur==0)
        gs.frame_start_tick=HAL_GetTick();//Systick_Get();

    gs.ges_sample_raw_cur++;
    if (gs.ges_sample_raw_cur>=gs.sample_size_raw)
    {
        gs.ges_sample_raw_cur=0;
        return 1;
    }
    else
        return 0;
}

//对每一次采样值判断是否手势到来
//输入：     ps->读取的采样值数组
//返回：     0-->数组未完全包含手势
//        1-->数组手势已完毕
uint8_t Ges_Detect_Sample(uint16_t *ps)
{
    uint8_t i,j,k,new_hold_AorL_size;
    uint32_t sum;
    uint16_t ges_dynamic_sample_raw_cur_temp;

    if(!gs.ges_dynamic_start && Ges_Start_Detect(ps))
    {
        LOG_DEBUG("\r\nStart.\r\n");
        //gs.ges_sample_raw_cur = 0; //基准值数组复位
        gs.ges_dynamic_start = true;
        gs.ges_dynamic_sample_size = 0;
        gs.ges_dynamic_sample_raw_cur = 0;
        //gs.sample_size = GES_SAMPLE_ARRAY_NUM_L;
        //gs.sample_size_raw = GES_SAMPLE_RAW_ARRAY_NUM_L;
    }

    if(gs.ges_dynamic_start)
    {
        for (i=0;i<GES_CHN_NUM;i++)
        {
            ges_dynamic_sample_raw_cur_temp=gs.ges_dynamic_sample_raw_cur;
            gs.ges_dynamic_sample_array[i][ges_dynamic_sample_raw_cur_temp]=ps[i];
            ges_dynamic_sample_raw_cur_temp++;
        }
        //在每一帧的开始记录时间
        //if (gs.ges_sample_raw_cur==0)
        //    gs.frame_start_tick=Systick_Get();

        gs.ges_dynamic_sample_size++; //can be the last array index[24]
        gs.ges_dynamic_sample_raw_cur++;
        if (gs.ges_dynamic_sample_raw_cur>=gs.new_hold_AorL_size)
        {
            LOG_DEBUG("sample overflow! HOLD/AP/LE size[%d] times[%d].\r\n", gs.new_hold_AorL_size,overflow_time);
            LOG_DEBUG("hold flag[%d].\r\n", gs.hold_flag);
            gs.ges_dynamic_start = false;
            overflow_time++;
            if(overflow_time>2 && !gs.hold_flag)
            {
                Ges_DynamicCalib();
                overflow_time=0;
                return 0;
            }
            //gs.ges_sample_raw_cur=0;            //基准值计算数组此时重新开始取值
            return 1;
        }

