85hzc/ask_433/stm32f1/Src/App.c
        if(gs.ges_dynamic_start && Ges_Stop_Detect(ps))
        {
            LOG_DEBUG("Stop.\r\n");
            gs.hold_flag = false;
            gs.ges_sample_raw_cur=0;            //基准值计算数组此时重新开始取值
            gs.ges_dynamic_start = false;
            return 1;
        }
    }

    return 0;
}

//手势采样技术
/*
void Ges_Tick_Check(void)
{
    gs.sample_counter++;
    if (gs.sample_counter>=gs.sample_frequency)
    {
        gs.sample_counter=0;
        gs.sample_start_flag=1;
    }
}

//中断处理函数
void Ges_It_Handle(void)
{
    if (__HAL_GPIO_EXTI_GET_IT(INT_Pin)!=RESET)  
    {  
        gs.sample_ready_flag=1;
    }
}
*/
#if (0)

//对某一帧进行寻找峰值
//输入： ps      --> 读取的采样值数组
//      chn     --> 寻峰的通道号
//      pindex  --> 峰值的index指针
//返回：             在此帧中具有的手势类型
uint8_t Ges_Peak_Find(uint16_t *ps,uint8_t chn,uint16_t *pindex)
{
    uint16_t i,res,max,min,max_index;
    res=GES_NULL;
    
    //求最大值、最小值及最大值、最小值位置
    for (i=0,max=0,min=0xFFFF,max_index=0;i<gs.sample_size;i++)
    {
        if (ps[i]>max)
        {
            max=ps[i];
            max_index=i;
        }
        if (ps[i]<min)
        {
            min=ps[i];
//          min_index=i;
        }
    }
    
    //存在有效峰值
//  if ((max>gs.sample_up_limit[chn])&&(min<=gs.sample_down_limit[chn]))
    if (max>gs.sample_up_limit[chn])        
    {
        //峰值是最后一个数据
        if (max_index==(gs.sample_size-1))
        {
            res=GES_LEVEL1_APPROACH;
            *pindex=max_index;          
        }
        //峰值是第一个数据
        else if (max_index==0)
        {
            res=GES_LEVEL1_LEAVE;
            *pindex=max_index;          
        }
        //峰值在中间
        else
        {
            res=GES_LEVEL1_FULL;
            *pindex=max_index;          
        }
//      if ((ps[0]<=gs.sample_down_limit[chn])&&(ps[GES_SAMPLE_ARRAY_NUM-1]>gs.sample_up_limit[chn]))
//      {
//          res=GES_LEVEL1_APPROACH;
//          *pindex=max_index;
//      }
//      else if ((ps[0]>gs.sample_up_limit[chn])&&(ps[GES_SAMPLE_ARRAY_NUM-1]<=gs.sample_down_limit[chn]))
//      {
//          res=GES_LEVEL1_LEAVE;
//          *pindex=max_index;
//      }
//      else if ((ps[0]<=gs.sample_down_limit[chn])&&(ps[GES_SAMPLE_ARRAY_NUM-1]<=gs.sample_down_limit[chn]))
//      {
//          res=GES_LEVEL1_FULL;
//          *pindex=max_index;
//      }
    }
    return res;
}
#endif

//对某一帧进行寻找边沿
//输入： ps      --> 读取的采样值数组
//      chn     --> 寻边沿的通道号
//      pindex  --> 上升沿超过阈值的index指针
//返回：             在此帧中具有的手势类型
uint8_t Ges_Edge_Find(uint16_t *ps,uint8_t chn,uint16_t *pindex)
{
    uint16_t i,res,rise,fall,rise_index,fall_index;
    res=GES_NULL;
    
    //从初始值开始寻找上升沿
    if (ps[0]<gs.sample_down_limit[chn])
    {
        for (i=0,rise=0;i<gs.sample_size;i++)
        {
            if (ps[i]>gs.sample_up_limit[chn])
            {
                rise=1;
                rise_index=i;
                break;
            }
        }
    }
    if (rise)
    {
        //从上次寻找地方开始
        for (i=rise_index;i<gs.sample_size;i++)
        {
            if (ps[i]<gs.sample_down_limit[chn])
            {
                fall=1;
                fall_index=i;
                break;
            }
        }
    }
    
    //从末尾值开始寻找下降沿
    if ((!fall)&&(ps[gs.sample_size-i-1]<gs.sample_down_limit[chn]))
    {
        for (i=0;i<gs.sample_size;i++)
        {
            if (ps[gs.sample_size-i-1]>gs.sample_down_limit[chn])
            {
                fall=1;
                fall_index=i+1;
                break;
            }
        }
    }
    
    if (rise&&fall)
    {
        res=GES_LEVEL1_FULL;
        *pindex=rise_index;
    }
    else if (rise)
    {
        res=GES_LEVEL1_APPROACH;
        *pindex=rise_index;
    }
    else if (fall)
    {
        res=GES_LEVEL1_LEAVE;
        *pindex=fall_index;
    }
    return res;
}


//对某一帧进行波形趋势寻找
//输入： chn     --> 寻边沿的通道号
//
//返回：             在此帧中具有的手势类型   （接近/原理）
uint8_t Ges_Trend_Find(uint8_t chn)
{
    uint8_t i,j,num_per_section;
    uint32_t total[SECTION_NUM];
    num_per_section = GES_SAMPLE_ARRAY_NUM_L/SECTION_NUM;

    memset(total,0,sizeof(total));
    for(i=0;i<SECTION_NUM;i++)
    {
        for(j=0;j<num_per_section;j++)
        {
            total[i] += gs.ges_sample_array[chn][j+i*num_per_section];
        }
    }

    if(total[0]>total[1] && total[1]>total[2] &&
        total[2]>40)
    {
        LOG_DEBUG("Ges_Trend_Find {chn[%d] leave}\r\n",chn);
        return GES_LEVEL1_LEAVE;
    }
    if(total[0]<total[1] && total[1]<total[2]) //&& total[0]>40)
    {
        LOG_DEBUG("Ges_Trend_Find {chn[%d] apporach}\r\n",chn);
        return GES_LEVEL1_APPROACH;
    }

    return GES_NULL;
}

uint8_t Ges_Trend_DynamicFind(uint8_t chn)
{
    uint8_t i,j,num_per_section;
    uint32_t total[SECTION_NUM];

    num_per_section = GES_SAMPLE_ARRAY_NUM_L/SECTION_NUM;

    memset(total,0,sizeof(total));
    for(i=0;i<SECTION_NUM;i++)
    {
        for(j=0;j<num_per_section;j++)
        {
            total[i] += gs.ges_dynamic_sample_array[chn][j+i*num_per_section];
        }
    }
    LOG_DEBUG("chn[%d] leave %d %d %d  %d\r\n",chn,total[0],total[1],total[2],total[0]-total[2]);

    if(total[0]>total[1] && total[1]>total[2] &&
        total[0]-total[2]>=80)
    {
        LOG_DEBUG("Ges_Trend_Find  leave\r\n");
        return GES_LEVEL1_LEAVE;
    }
    if(total[0]<total[1] && total[1]<total[2] &&
        total[2]-total[0]>=80)
    {
        LOG_DEBUG("Ges_Trend_Find  appor\r\n");
        return GES_LEVEL1_APPROACH;
    }

    return GES_NULL;
}

uint8_t Ges_Hold_Judge(uint8_t chn)
{
    uint8_t i,j,res=0;
    uint32_t total[8];
    uint32_t tt= 0, tt1=0;


    memset(total,0,sizeof(total));
    for(i=0;i<8;i++)
    {
        for(j=0;j<3;j++)
        {
            total[i] += gs.ges_dynamic_sample_array[chn][j+i*3];
            tt += gs.ges_dynamic_sample_array[chn][j+i*3];
        }
    }

    tt1 = tt/8;
    for(i=0;i<8;i++)
    {
        //LOG_DEBUG("[i:%d] %d\r\n",i,abs(tt1-total[i])*100/tt1);
        if(abs(tt1-total[i])*100/tt1>70)
        {
            LOG_DEBUG("Ges_Hold_Judge fail 2.\r\n");
            return 2;
        }
        if(abs(tt1-total[i])*100/tt1>10)
        {
            res = 1;
        }
    }

    LOG_DEBUG("Ges_Hold_Judge fail %d.\r\n",res);
    return res;
}

