85hzc/ask_433/stm32f1/Src/App.c
uint8_t Ges_Hold_Height_Judge()
{
    uint8_t chn;
    uint8_t i,res=0;
    uint64_t total[2]=0;
    uint32_t tt1[2]=0;

    for(chn=0;chn<2;chn++)
    {
        for(i=0;i<GES_SAMPLE_ARRAY_NUM_L;i++)
        {
            total[chn] += gs.ges_dynamic_sample_array[chn][i];
        }
        tt1[chn] = total[chn]/GES_SAMPLE_ARRAY_NUM_L;
        LOG_DEBUG("Ges_Hold_Height_Judge ch%d[%d].\r\n",chn,tt1[chn]);
    }

    if(tt1[0]+tt1[1]<200)
    {
        LOG_DEBUG("Ges_Hold_Height_Judge too low!\r\n");
        return 0;
    }

    if(!gs.hold_height_start)
        gs.hold_height_start = tt1[0]+tt1[1];
    else if(!gs.hold_height_stop)
        gs.hold_height_stop = tt1[0]+tt1[1];
    else
    {
        gs.hold_height_start = gs.hold_height_stop;
        gs.hold_height_stop = tt1[0]+tt1[1];
    }
    
    LOG_DEBUG("gs.hold_flag[%d]!\r\n",gs.hold_flag);

    if(gs.hold_flag)
    {
        if(gs.hold_height_start<gs.hold_height_stop)
        {

            LOG_DEBUG("Ges_Hold_Height_Judge approach[%d]!\r\n",gs.hold_height_stop-gs.hold_height_start);

            for(i=0;i<gs.hold_height_stop-gs.hold_height_start;i++)
            {
                brightness++;
                if(brightness>1000)
                {
                    return 1;
                }
                __HAL_TIM_SET_COMPARE(&htim3,TIM_CHANNEL_1, (uint32_t)brightness);
            }
        }
        else
        {
            LOG_DEBUG("Ges_Hold_Height_Judge leave[%d]!\r\n",gs.hold_height_start-gs.hold_height_stop);

            for(i=0;i<gs.hold_height_start-gs.hold_height_stop;i++)
            {
                brightness--;
                if(brightness<10)
                {
                    return 1;
                }
                __HAL_TIM_SET_COMPARE(&htim3,TIM_CHANNEL_1, (uint32_t)brightness);
            }
        }
        //turn_off = 1;
    }

    return 1;
}



uint8_t Ges_Hold_Height_Valid_Judge()
{
    uint8_t chn;
    uint8_t i,res=0;
    uint64_t total[2]=0;
    uint32_t tt1[2]=0;

    for(chn=0;chn<2;chn++)
    {
        for(i=0;i<GES_SAMPLE_ARRAY_NUM_L;i++)
        {
            total[chn] += gs.ges_dynamic_sample_array[chn][i];
        }
        tt1[chn] = total[chn]/GES_SAMPLE_ARRAY_NUM_L;
        LOG_DEBUG("Ges_Hold_Height_Judge ch%d[%d].\r\n",chn,tt1[chn]);
    }

    if(tt1[0]+tt1[1]<250)
    {
        LOG_DEBUG("Ges_Hold_Height_Judge < 250 too low!\r\n");
        return 0;
    }

    return 1;
}


uint8_t Ges_Hold_Height_AorL_Judge()
{
    uint8_t chn;
    uint8_t i,res=0;
    uint64_t total[2]=0;
    uint32_t tt1[2]=0;

    for(chn=0;chn<2;chn++)
    {
        for(i=0;i<GES_SAMPLE_ARRAY_NUM_S;i++)
        {
            total[chn] += gs.ges_dynamic_sample_array[chn][i];
        }
        tt1[chn] = total[chn]/GES_SAMPLE_ARRAY_NUM_S;
        LOG_DEBUG("Ges_Hold_Height_AorL_Judge ch%d[%d].\r\n",chn,tt1[chn]);
    }

    if(!gs.hold_height_start)
        gs.hold_height_start = tt1[0]+tt1[1];
    else if(!gs.hold_height_stop)
        gs.hold_height_stop = tt1[0]+tt1[1];
    else
    {
        gs.hold_height_start = gs.hold_height_stop;
        gs.hold_height_stop = tt1[0]+tt1[1];
    }
    LOG_DEBUG("stop-start[%d]!\r\n",gs.hold_height_stop-gs.hold_height_start);

    if(gs.hold_height_start<gs.hold_height_stop-10)
    {
        gs.hold_counter = SAMPLE_HOLD_COUNT+1;
        if(gs.sample_mode==POSITIVE)
        {
            LOG_DEBUG("Approach!\r\n");

#if(CHN3_GES==0) //do not adjust lighting by approach or leave
#if(SENSOR3)
            brightness+=50;
            if(brightness>1000)
            {
                brightness = 1000;
                //return 1;
            }
#else
            brightness-=50;
            if(brightness<100)
            {
                brightness = 100;
                //return 1;
            }
#endif
#endif
        }
        else if(gs.sample_mode==NEGATIVE)
        {
            LOG_DEBUG("Leave!\r\n");

#if(CHN3_GES==0) //do not adjust lighting by approach or leave
#if(SENSOR3)
                brightness-=50;
                if(brightness<100)
                {
                    brightness = 100;
                    //return 1;
                }
#else
                brightness+=50;
                if(brightness>1000)
                {
                    brightness = 1000;
                    //return 1;
                }
#endif
#endif
        }
    }
    else if(gs.hold_height_start-10>gs.hold_height_stop)
    {
        gs.hold_counter = SAMPLE_HOLD_COUNT+1;

        if(gs.sample_mode==POSITIVE)
        {
            LOG_DEBUG("Leave!\r\n");

#if(CHN3_GES==0) //do not adjust lighting by approach or leave
#if(SENSOR3)
            brightness-=20;
            if(brightness<100)
            {
                brightness = 100;
                //return 1;
            }
#else
            brightness+=20;
            if(brightness>1000)
            {
                brightness = 1000;
                //return 1;
            }
#endif
#endif
        }
        else if(gs.sample_mode==NEGATIVE)
        {
            LOG_DEBUG("Approach!\r\n");

#if(CHN3_GES==0) //do not adjust lighting by approach or leave
#if(SENSOR3)
            brightness+=20;
            if(brightness>1000)
            {
                brightness = 1000;
                //return 1;
            }
#else
            brightness-=20;
            if(brightness<100)
            {
                brightness = 100;
                //return 1;
            }
#endif
#endif
        }
    }
    else
    {
        LOG_DEBUG("Stop wave!\r\n");
        LOG_DEBUG("TO ReCalib base value!\r\n");
        Ges_Calib(false);
        gs.sample_mode = 0;
        //gs.calib_force = true;
        //gs.hold_flag = 0;
        //gs.hold_counter = 0;
        //gs.ges_sample_raw_cur=0;            //基准值计算数组此时重新开始取值
        gs.ges_dynamic_start = false;
    }
    //turn_off = 1;

    return 1;
}

//对某一帧进行波形寻找
//输入： chn     --> 寻边沿的通道号
//      pindex  --> 峰值index指针
//返回：             在此帧中具有的手势类型
uint8_t Ges_Wave_Search(uint8_t chn,uint16_t *pindex)
{
    uint16_t i,res;
//  uint32_t sum;
    uint8_t hold_flag=1;
    res=GES_NULL;
    
    //初始化
    gs.wave[chn].fall_index=GES_INVALID_INDEX;
    gs.wave[chn].rise_index=GES_INVALID_INDEX;
    gs.wave[chn].peak_index=GES_INVALID_INDEX;
    
    //求峰值、上升沿、下降沿及峰值、上升沿、下降沿位置和平均值
    for (i=0,gs.wave[chn].peak_value=0;i<gs.sample_size;i++)
    {
        if ((i>=(gs.sample_size-SAMPLE_HOLD_END_SHIFT))&&(gs.ges_sample_array[chn][i]<SAMPLE_HOLD_LIMIT_DEF))
            hold_flag=0;

        if (gs.ges_sample_array[chn][i]>gs.wave[chn].peak_value)
        {
            gs.wave[chn].peak_value=gs.ges_sample_array[chn][i];
            gs.wave[chn].peak_index=i;
        }
        if (i<gs.sample_size-1)
        {
            if ((gs.ges_sample_array[chn][i]<gs.sample_down_limit[chn])&&
                (gs.ges_sample_array[chn][i+1]>=gs.sample_down_limit[chn]))
            {
                gs.wave[chn].rise_value=gs.ges_sample_array[chn][i+1];
                gs.wave[chn].rise_index=i+1;
            }
            if ((gs.ges_sample_array[chn][i]>=gs.sample_down_limit[chn])&&
                (gs.ges_sample_array[chn][i+1]<gs.sample_down_limit[chn]))
            {
                gs.wave[chn].fall_value=gs.ges_sample_array[chn][i];
                gs.wave[chn].fall_index=i;
            }
        }
    }
    if ((gs.sample_size==GES_SAMPLE_ARRAY_NUM_L)&&(hold_flag==1))
    {
        LOG_DEBUG("after a hold Ges.\r\n");
        res = Ges_Trend_Find(chn);

        if(GES_NULL==res)
            res=GES_LEVEL1_HOLD;
/*
        if (gs.wave[chn].peak_index==(gs.sample_size-1) &&
            gs.ges_sample_array[chn][gs.sample_size-1]-gs.ges_sample_array[chn][0]>200)
        {
            LOG_DEBUG("hold {apporach}\r\n");
            res=GES_LEVEL1_APPROACH;
        }
        else if (gs.wave[chn].peak_index==0 &&
            gs.ges_sample_array[chn][0]-gs.ges_sample_array[chn][gs.sample_size-1]>200)
        {
            LOG_DEBUG("hold {leave}\r\n");
            res=GES_LEVEL1_LEAVE;
        }
*/
        *pindex=GES_SAMPLE_ARRAY_NUM_S-1;
        return res;
    }
//  if ((gs.wave[chn].rise_index!=GES_INVALID_INDEX)&&(gs.wave[chn].fall_index!=GES_INVALID_INDEX))
//  {
//      res=GES_LEVEL1_FULL;
//  }
//  else if (gs.wave[chn].rise_index!=GES_INVALID_INDEX)
//  {
//      res=GES_LEVEL1_APPROACH;
//  }
//  else if (gs.wave[chn].fall_index!=GES_INVALID_INDEX)
//  {
//      res=GES_LEVEL1_LEAVE;
//  }
    if ((gs.wave[chn].peak_index!=GES_INVALID_INDEX)&&(gs.wave[chn].peak_value>gs.sample_up_limit[chn]))
    {

