85hzc/ask_433/stm32f1/Src/App.c
        if(GES_SAMPLE_ARRAY_NUM_L == gs.sample_size)
        {
            res = Ges_Trend_Find(chn);

            if(GES_NULL==res)
                res=GES_LEVEL1_FULL;
        }
        else
        {
            //峰值是最后一个数据
            if (gs.wave[chn].peak_index==(gs.sample_size-1))
            {
                res=GES_LEVEL1_APPROACH;
                //*pindex=gs.wave[chn].peak_index;
            }
            //峰值是第一个数据
            else if (gs.wave[chn].peak_index==0)
            {
                res=GES_LEVEL1_LEAVE;
                //*pindex=gs.wave[chn].peak_index;
            }
            //峰值在中间
            else
            {
                res=GES_LEVEL1_FULL;
                //*pindex=gs.wave[chn].peak_index;
            }
        }
        *pindex=gs.wave[chn].peak_index;
    }
    return res;
}

#if(CHN3_GES)
void Ges_Search_index(DETECT_E detectType, uint8_t *search_start_ch,uint8_t *search_end_ch,uint8_t *start,uint8_t *end)
{
    uint8_t i;

    switch(detectType)
    {
        case DETECT_PEAK:
            if(gs.wave[0].peak_index!=GES_INVALID_INDEX&&
                gs.wave[1].peak_index!=GES_INVALID_INDEX&&
                gs.wave[2].peak_index!=GES_INVALID_INDEX)
            {
                for(i=0;i<GES_CHN_NUM;i++)
                {
                    if(*start>gs.wave[i].peak_index)
                    {
                        *search_start_ch = i;
                        *start = gs.wave[i].peak_index;
                    }
                    if(*end<gs.wave[i].peak_index)
                    {
                        *search_end_ch = i;
                        *end = gs.wave[i].peak_index;
                    }
                }
                return;
            }
            break;

        case DETECT_FALL:
            if(gs.wave[0].fall_index!=GES_INVALID_INDEX&&
                gs.wave[1].fall_index!=GES_INVALID_INDEX&&
                gs.wave[2].fall_index!=GES_INVALID_INDEX)
            {
                for(i=0;i<GES_CHN_NUM;i++)
                {
                    if(*start>gs.wave[i].fall_index)
                    {
                        *search_start_ch = i;
                        *start = gs.wave[i].fall_index;
                    }
                    if(*end<gs.wave[i].fall_index)
                    {
                        *search_end_ch = i;
                        *end = gs.wave[i].fall_index;
                    }
                }
                return;
            }
            break;
                
        case DETECT_RISE:
            if(gs.wave[0].rise_index!=GES_INVALID_INDEX&&
                gs.wave[1].rise_index!=GES_INVALID_INDEX&&
                gs.wave[2].rise_index!=GES_INVALID_INDEX)
            {
                for(i=0;i<GES_CHN_NUM;i++)
                {
                    if(*start>gs.wave[i].rise_index)
                    {
                        *search_start_ch = i;
                        *start = gs.wave[i].rise_index;
                    }
                    if(*end<gs.wave[i].rise_index)
                    {
                        *search_end_ch = i;
                        *end = gs.wave[i].rise_index;
                    }
                }
                return;
            }
            break;
    }

    return;
}

uint8_t Ges_Calc_3chn(DETECT_E detectType, uint8_t start, uint8_t end)
{
    uint8_t search_start_ch=0,search_end_ch=0;

    Ges_Search_index(detectType,&search_start_ch,&search_end_ch,&start,&end);

    if(search_start_ch == GES_CHN_DOWN_RIGHT)
    {
        if(search_end_ch == GES_CHN_DOWN_LEFT)
        {
            return GES_LEVEL2_LEFT;
        }
        else if(search_end_ch == GES_CHN_UP)
        {
            return GES_LEVEL2_UP;
        }
    }
    else if(search_start_ch == GES_CHN_DOWN_LEFT)
    {
        if(search_end_ch == GES_CHN_DOWN_RIGHT)
        {
            return GES_LEVEL2_RIGHT;
        }
        else if(search_end_ch == GES_CHN_UP)
        {
            return GES_LEVEL2_UP;
        }
    }
    else
    {
        return GES_LEVEL2_DOWN;
    }

    return GES_NULL;
}

uint8_t Ges_Calc_2chn_in_one(DETECT_E detectType)
{
    uint8_t i,A_C,B_C,B_A;

    B_C=Ges_Wave_Lead_3chn(detectType,GES_CHN_DOWN_LEFT,GES_CHN_UP);
    B_A=Ges_Wave_Lead_3chn(detectType,GES_CHN_DOWN_LEFT,GES_CHN_DOWN_RIGHT);
    A_C=Ges_Wave_Lead_3chn(detectType,GES_CHN_DOWN_RIGHT,GES_CHN_UP);

    if(B_C == GES_CHN_isochronal)
    {
        if(B_A == GES_CHN_DOWN_LEFT)
            return GES_LEVEL2_RIGHT;
        else if(B_A == GES_CHN_DOWN_RIGHT)
            return GES_LEVEL2_LEFT;
    }
    else if(A_C == GES_CHN_isochronal)
    {
        if(B_A == GES_CHN_DOWN_LEFT)
            return GES_LEVEL2_RIGHT;
        else if(B_A == GES_CHN_DOWN_RIGHT)
            return GES_LEVEL2_LEFT;
    }
    else if(B_A == GES_CHN_isochronal)
    {
        if(B_C == GES_CHN_DOWN_LEFT)
            return GES_LEVEL2_UP;
        else if(B_C == GES_CHN_UP)
            return GES_LEVEL2_DOWN;
    }

    return GES_NULL;
}

//判断三个信道波形发生的先后关系
//输入： chn1    --> 第一波形
//      chn2    --> 第二波形
//      chn3    --> 第二波形
//返回： chn1    --> 第一波形领先
//      chn2    --> 第二波形领先
//      chn3    --> 第二波形领先
//      0xFF    --> 无法判断
uint8_t Ges_Wave_Calc_3chn(uint8_t full_flag)
{
    uint8_t i,basic_ges = GES_NULL;
    uint8_t start = 0xff,end = 0;
    DETECT_E detectType = DETECT_MAX;
    uint8_t ges_peak = GES_NULL,ges_fall = GES_NULL,ges_rise = GES_NULL;
    //判断三个index的分布
    //1.    111
    //for (i=0;i<GES_CHN_NUM;i++)
    //{
    //    basic_ges=Ges_Wave_Search_3chn(i);
    //}

    if(!((gs.wave[0].peak_index!=GES_INVALID_INDEX&&
        gs.wave[1].peak_index!=GES_INVALID_INDEX&&
        gs.wave[2].peak_index!=GES_INVALID_INDEX) && (
        gs.wave[0].fall_index!=GES_INVALID_INDEX&&
        gs.wave[1].fall_index!=GES_INVALID_INDEX&&
        gs.wave[2].fall_index!=GES_INVALID_INDEX) && (
        gs.wave[0].rise_index!=GES_INVALID_INDEX&&
        gs.wave[1].rise_index!=GES_INVALID_INDEX&&
        gs.wave[2].rise_index!=GES_INVALID_INDEX)
        ))
    {
        LOG_DEBUG("GES Invalid.\r\n");
        return basic_ges;
    }

    //3 chn are all of full gesture type
    if(full_flag >= 2)
    {
        if((gs.wave[GES_CHN_DOWN_RIGHT].peak_index != gs.wave[GES_CHN_DOWN_LEFT].peak_index) &&
            (gs.wave[GES_CHN_DOWN_RIGHT].peak_index != gs.wave[GES_CHN_UP].peak_index) && 
            (gs.wave[GES_CHN_DOWN_LEFT].peak_index != gs.wave[GES_CHN_UP].peak_index))
        {
            //suppose this case
            start = gs.wave[GES_CHN_DOWN_RIGHT].peak_index;
            end = gs.wave[GES_CHN_DOWN_RIGHT].peak_index;
            detectType = DETECT_PEAK;
        }
        else if((gs.wave[GES_CHN_DOWN_RIGHT].fall_index != gs.wave[GES_CHN_DOWN_LEFT].fall_index) &&
            (gs.wave[GES_CHN_DOWN_RIGHT].fall_index != gs.wave[GES_CHN_UP].fall_index) && 
            (gs.wave[GES_CHN_DOWN_LEFT].fall_index != gs.wave[GES_CHN_UP].fall_index))
        {
            //suppose this case
            start = gs.wave[GES_CHN_DOWN_RIGHT].fall_index;
            end = gs.wave[GES_CHN_DOWN_RIGHT].fall_index;
            detectType = DETECT_FALL;
        }
        else if((gs.wave[GES_CHN_DOWN_RIGHT].rise_index != gs.wave[GES_CHN_DOWN_LEFT].rise_index) &&
            (gs.wave[GES_CHN_DOWN_RIGHT].rise_index != gs.wave[GES_CHN_UP].rise_index) && 
            (gs.wave[GES_CHN_DOWN_LEFT].rise_index != gs.wave[GES_CHN_UP].rise_index))
        {
            //suppose this case
            start = gs.wave[GES_CHN_DOWN_RIGHT].rise_index;
            end = gs.wave[GES_CHN_DOWN_RIGHT].rise_index;
            detectType = DETECT_RISE;
        }

        if(detectType!=DETECT_MAX)
            return Ges_Calc_3chn(detectType,start,end);
    }

    //2.有两个通道信号在相同相位
    ges_peak = Ges_Calc_2chn_in_one(DETECT_PEAK);
    ges_fall = Ges_Calc_2chn_in_one(DETECT_FALL);
    ges_rise = Ges_Calc_2chn_in_one(DETECT_RISE);

    LOG_DEBUG("2 position in 1[%x %x %x]\r\n",ges_peak,ges_fall,ges_rise);

    if(ges_peak!=GES_NULL && ges_peak==ges_fall)
        basic_ges = ges_peak;
    else if(ges_peak!=GES_NULL && ges_peak==ges_rise)
        basic_ges = ges_peak;
    else if(ges_fall!=GES_NULL && ges_fall==ges_rise)
        basic_ges = ges_fall;
    else if(ges_peak!=GES_NULL)
        basic_ges = ges_peak;
    else if(ges_fall!=GES_NULL)
        basic_ges = ges_fall;
    else if(ges_rise!=GES_NULL)
        basic_ges = ges_rise;

