85hzc/ask_433/stm32f1/Src/App.c
    return basic_ges;
}

uint8_t Ges_Wave_Lead_3chn(DETECT_E detectType,uint8_t chn1,uint8_t chn2)
{
    //highest priority
    if(detectType==DETECT_PEAK)
    {
        if ((gs.wave[chn1].peak_index!=GES_INVALID_INDEX)&&
            (gs.wave[chn2].peak_index!=GES_INVALID_INDEX))
        {
            if (gs.wave[chn1].peak_index<gs.wave[chn2].peak_index)
                return chn1;
            else if (gs.wave[chn1].peak_index>gs.wave[chn2].peak_index)
                return chn2;
            else
                return GES_CHN_isochronal;
            }
    }
    
    if(detectType==DETECT_FALL)
    {
        //Second priority 
        if ((gs.wave[chn1].fall_index!=GES_INVALID_INDEX)&&
            (gs.wave[chn2].fall_index!=GES_INVALID_INDEX))
        {
            if (gs.wave[chn1].fall_index<gs.wave[chn2].fall_index)
                return chn1;
            else if (gs.wave[chn1].fall_index>gs.wave[chn2].fall_index)
                return chn2;
            else
                return GES_CHN_isochronal;
        }
    }
    
    if(detectType==DETECT_RISE)
    {
        //Third priority 
        if ((gs.wave[chn1].rise_index!=GES_INVALID_INDEX)&&
            (gs.wave[chn2].rise_index!=GES_INVALID_INDEX))
        {
            if (gs.wave[chn1].rise_index<gs.wave[chn2].rise_index)
                return chn1;
            else if (gs.wave[chn1].rise_index>gs.wave[chn2].rise_index)
                return chn2;
            else
                return GES_CHN_isochronal;
        }
    }
    /*
    if((gs.wave[chn1].rise_index==gs.wave[chn2].rise_index) &&
        (gs.wave[chn1].peak_index==gs.wave[chn2].peak_index) &&
        (gs.wave[chn1].fall_index==gs.wave[chn2].fall_index))
    {
        return GES_CHN_isochronal;
    }
    if ((gs.wave[chn1].rise_index!=GES_INVALID_INDEX)&&
        ((gs.wave[chn2].fall_index!=GES_INVALID_INDEX)||
        (gs.wave[chn2].peak_index!=GES_INVALID_INDEX)))
        return chn2;
    if ((gs.wave[chn2].rise_index!=GES_INVALID_INDEX)&&
        ((gs.wave[chn1].fall_index!=GES_INVALID_INDEX)||
        (gs.wave[chn1].peak_index!=GES_INVALID_INDEX)))
        return chn1;
    */
    return GES_CHN_INVALID;
}
#endif

//判断两个波形发生的先后关系
//输入： chn1    --> 第一波形
//      chn2    --> 第二波形
//返回： chn1    --> 第一波形领先
//      chn2    --> 第二波形领先
//      0xFF    --> 无法判断
uint8_t Ges_Wave_Lead(uint8_t chn1,uint8_t chn2)
{
    if ((gs.wave[chn1].rise_index!=GES_INVALID_INDEX)&&
        (gs.wave[chn2].rise_index!=GES_INVALID_INDEX))
    {
        if (gs.wave[chn1].rise_index<gs.wave[chn2].rise_index)
            return chn1;
        else if (gs.wave[chn1].rise_index>gs.wave[chn2].rise_index)
            return chn2;
    }

    if ((gs.wave[chn1].fall_index!=GES_INVALID_INDEX)&&
        (gs.wave[chn2].fall_index!=GES_INVALID_INDEX))
    {
        if (gs.wave[chn1].fall_index<gs.wave[chn2].fall_index)
            return chn1;
        else if (gs.wave[chn1].fall_index>gs.wave[chn2].fall_index)
            return chn2;
    }

    if ((gs.wave[chn1].peak_index!=GES_INVALID_INDEX)&&
        (gs.wave[chn2].peak_index!=GES_INVALID_INDEX))
    {
        if (gs.wave[chn1].peak_index<gs.wave[chn2].peak_index)
            return chn1;
        else if (gs.wave[chn1].peak_index>gs.wave[chn2].peak_index)
            return chn2;
    }

    if ((gs.wave[chn1].rise_index!=GES_INVALID_INDEX)&&
        (gs.wave[chn2].rise_index!=GES_INVALID_INDEX)&&
        (gs.wave[chn1].fall_index!=GES_INVALID_INDEX)&&
        (gs.wave[chn1].fall_index!=GES_INVALID_INDEX))
    {
        if(gs.ges_dynamic_start_chn != GES_CHN_INVALID && 
            gs.ges_dynamic_start_chn==chn1)
            return chn1;
        else if(gs.ges_dynamic_start_chn != GES_CHN_INVALID && 
            gs.ges_dynamic_start_chn==chn2)
            return chn2;
    }

    return GES_CHN_INVALID;
}


//对某一帧进行波形寻找
//输入： chn     --> 寻边沿的通道号
//      pindex  --> 峰值index指针
//返回：             在此帧中具有的手势类型,一级手势（接近、远离、HOLD、FULL）
uint8_t Ges_Wave_DynamicSearch(uint8_t chn,uint16_t *pindex)
{
    uint16_t i,res=GES_NULL;
//  uint32_t sum;
    uint8_t rise_flag = 0;
    uint8_t wave_flag=0,hold_flag=1, hold_section_times;

    //初始化
    gs.wave[chn].fall_index=GES_INVALID_INDEX;
    gs.wave[chn].rise_index=GES_INVALID_INDEX;
    gs.wave[chn].peak_index=GES_INVALID_INDEX;
    gs.wave[chn].peak_value=0;
    gs.sample_down_limit[chn] = SAMPLE_DOWN_LIMIT_DEF;

    hold_section_times = gs.ges_dynamic_sample_size/2;
/*
    if(gs.ges_dynamic_sample_size==GES_SAMPLE_ARRAY_NUM_L)
    {
        wave_flag = Ges_Hold_Judge(chn);
    }
*/
    //求峰值及峰值位置
    for (i=0;i<gs.ges_dynamic_sample_size;i++)
    {

        if ((gs.ges_dynamic_sample_array[chn][i]>gs.wave[chn].peak_value)&&
            (gs.ges_dynamic_sample_array[chn][i]>=gs.sample_up_limit[chn]))
        {
            gs.wave[chn].peak_value=gs.ges_dynamic_sample_array[chn][i];
            gs.wave[chn].peak_index=i;
        }
    }

    if(gs.wave[chn].peak_index!=GES_INVALID_INDEX)
    {
        gs.sample_down_limit[chn] = (gs.wave[chn].peak_value - SAMPLE_DOWN_LIMIT_DEF)/4 + SAMPLE_DOWN_LIMIT_DEF;
    }

    //求峰值、上升沿、下降沿及峰值、上升沿、下降沿位置和平均值
    for (i=0;i<gs.ges_dynamic_sample_size;i++)
    {
        if ((i>=hold_section_times)&&(gs.ges_dynamic_sample_array[chn][i]<SAMPLE_HOLD_LIMIT_DEF))
            hold_flag=0;
/*
        if ((gs.ges_dynamic_sample_array[chn][i]>gs.wave[chn].peak_value)&&
            (gs.ges_dynamic_sample_array[chn][i]>=gs.sample_up_limit[chn]))
        {
            gs.wave[chn].peak_value=gs.ges_dynamic_sample_array[chn][i];
            gs.wave[chn].peak_index=i;
        }
*/
        if (i<gs.ges_dynamic_sample_size-1)
        {
            if (i==0) //动态采样的数组，第一个元素已经符合采样阈值
            {
                if (gs.ges_dynamic_sample_array[chn][i]>=gs.sample_down_limit[chn])
                {
                    gs.wave[chn].rise_value=gs.ges_dynamic_sample_array[chn][i];
                    gs.wave[chn].rise_index=i;
                }
            }

            //还未发现波峰之前，rise 有可能需要更新，增强健壮性
            if ((gs.ges_dynamic_sample_array[chn][i]<gs.sample_down_limit[chn])&&
                (gs.ges_dynamic_sample_array[chn][i+1]>=gs.sample_down_limit[chn])&&
                ((gs.wave[chn].rise_index==GES_INVALID_INDEX)||gs.wave[chn].peak_index==GES_INVALID_INDEX))
            {
                gs.wave[chn].rise_value=gs.ges_dynamic_sample_array[chn][i+1];
                gs.wave[chn].rise_index=i+1;
            }
            if ((gs.ges_dynamic_sample_array[chn][i]>=gs.sample_down_limit[chn])&&
                (gs.ges_dynamic_sample_array[chn][i+1]<gs.sample_down_limit[chn])&&
                (gs.wave[chn].fall_index==GES_INVALID_INDEX)&&
                (gs.wave[chn].peak_index!=GES_INVALID_INDEX))
            {
                gs.wave[chn].fall_value=gs.ges_dynamic_sample_array[chn][i];
                gs.wave[chn].fall_index=i;
            }
        }
    }

#if (LOG_ENABLE)
    LOG_DEBUG("ch%d limit:%5d  P[%2d %5d]  F[%2d %5d]  R[%2d %5d]\r\n",chn,gs.sample_down_limit[chn],
                gs.wave[chn].peak_index,gs.wave[chn].peak_value,
                gs.wave[chn].fall_index,gs.wave[chn].fall_value,
                gs.wave[chn].rise_index,gs.wave[chn].rise_value);
#endif

    if ((gs.ges_dynamic_sample_size==gs.new_hold_AorL_size/*32*/)&&(hold_flag))
    {
        LOG_DEBUG("Suppose hold\r\n");
/*
        if(gs.hold_flag)
        {
            res = Ges_Trend_DynamicFind(chn);
        }
*/
        if(GES_NULL==res)
            res=GES_LEVEL1_HOLD;
        *pindex=GES_SAMPLE_ARRAY_NUM_S-1;
        return res;
    }

    if ((gs.wave[chn].peak_index!=GES_INVALID_INDEX)&&(gs.wave[chn].peak_value>gs.sample_up_limit[chn]))
    {
    
#if (LOG_ENABLE)
        LOG_DEBUG("Not hold OR Not AorL size %d.\r\n",gs.new_hold_AorL_size);
#endif

        if (GES_SAMPLE_ARRAY_NUM_L == gs.ges_dynamic_sample_size)//采样队列满
        {
            if (gs.hold_flag)
            {
                res = Ges_Trend_DynamicFind(chn);
            }
            else if(/*2==wave_flag && */GES_NULL==res)
            {
                res = GES_LEVEL1_FULL;
            }
        }
        else
        {
            //峰值是最后一个数据
            if (gs.wave[chn].peak_index==gs.ges_dynamic_sample_size-1)
            {
                res=GES_LEVEL1_APPROACH;
                //*pindex=gs.wave[chn].peak_index;
            }
            //峰值是第一个数据
            else if (gs.wave[chn].peak_index==0)
            {
                res=GES_LEVEL1_LEAVE;
                //*pindex=gs.wave[chn].peak_index;
            }
            //峰值在中间
            else
            {
                res=GES_LEVEL1_FULL;
                //*pindex=gs.wave[chn].peak_index;
            }
        }
        *pindex=gs.wave[chn].peak_index;
    }
    return res;
}

//对某一帧进行手势分析
//返回：         在此帧中具有的手势类型
uint8_t Ges_Analysis(void)
{
    uint8_t i,basic_ges,res,chn,hold_flag;
    uint16_t index;
    
    res=GES_NULL;
    chn=0;
    hold_flag=0;

#if(!CALIB_OBO)
    //标准化手势数组
    Ges_Normalize();
#endif
    for (i=0;i<GES_CHN_NUM;i++)
    {
//      basic_ges=Ges_Peak_Find(gs.ges_sample_array[i],i,&index);
//      basic_ges=Ges_Edge_Find(gs.ges_sample_array[i],i,&index);
        basic_ges=Ges_Wave_Search(i,&index);
        if (basic_ges==GES_LEVEL1_APPROACH)
        {
            gs.ges_record[i].ges=basic_ges;
            //gs.ges_record[i].add_time=gs.frame_start_tick+(index*SAMPLE_FREQUENCY_DEF*GES_SAMPLE_AVE_NUM);
            chn|=(1<<i);
//          res=1;
#if (LOG_ENABLE)
            LOG_DEBUG("tick: %lld, CHN%d ges: approach!\r\n",gs.ges_record[i].add_time,i);
#endif
        }
        else if (basic_ges==GES_LEVEL1_LEAVE)
        {
            gs.ges_record[i].ges=basic_ges;
            //gs.ges_record[i].add_time=gs.frame_start_tick+(index*SAMPLE_FREQUENCY_DEF*GES_SAMPLE_AVE_NUM);
            chn|=(1<<i);
//          res=1;
#if (LOG_ENABLE)
            LOG_DEBUG("tick: %lld, CHN%d ges: leave!\r\n",gs.ges_record[i].add_time,i);
#endif
        }
        else if (basic_ges==GES_LEVEL1_FULL)
        {
            gs.ges_record[i].ges=basic_ges;
            //gs.ges_record[i].add_time=gs.frame_start_tick+(index*SAMPLE_FREQUENCY_DEF*GES_SAMPLE_AVE_NUM);
            chn|=(1<<i);
//          res=1;
#if (LOG_ENABLE)
            LOG_DEBUG("tick: %lld, CHN%d ges: full!\r\n",gs.ges_record[i].add_time,i);
#endif
        }
        else if (basic_ges==GES_LEVEL1_HOLD)
        {
            gs.ges_record[i].ges=basic_ges;
            //gs.ges_record[i].add_time=gs.frame_start_tick+(index*SAMPLE_FREQUENCY_DEF*GES_SAMPLE_AVE_NUM);
            chn|=(1<<i);
#if (LOG_ENABLE)
            LOG_DEBUG("tick: %lld, CHN%d ges: hold!\r\n",gs.ges_record[i].add_time,i);
#endif
#if(HOLD_GES==1)
            hold_flag++;
#endif
//          res=GES_LEVEL2_HOLD;
//          return res;
        }
    }
    
    //有新的手势
    if (chn)
    {
#if(HOLD_GES==1)
        if (hold_flag)
        {
            res=GES_LEVEL2_HOLD;
            return res;
        }
#endif
        if ((chn&(1<<GES_CHN_DOWN_LEFT))&&(chn&(1<<GES_CHN_DOWN_RIGHT)))
        {
            if(gs.ges_record[GES_CHN_DOWN_LEFT].ges==GES_LEVEL1_APPROACH &&
                gs.ges_record[GES_CHN_DOWN_RIGHT].ges==GES_LEVEL1_APPROACH)
            {
                res=GES_LEVEL2_APPROACH;
                return res;
            }
            else if(gs.ges_record[GES_CHN_DOWN_LEFT].ges==GES_LEVEL1_LEAVE &&
                gs.ges_record[GES_CHN_DOWN_RIGHT].ges==GES_LEVEL1_LEAVE)
            {
                res=GES_LEVEL2_LEAVE;
                return res;
            }
        }

        if (chn&(1<<GES_CHN_UP))
            //重置last_ges_record
            gs.last_ges_record[GES_CHN_UP]=gs.ges_record[GES_CHN_UP];
        if (chn&(1<<GES_CHN_DOWN_LEFT))
            //重置last_ges_record
            gs.last_ges_record[GES_CHN_DOWN_LEFT]=gs.ges_record[GES_CHN_DOWN_LEFT];
        if (chn&(1<<GES_CHN_DOWN_RIGHT))
            //重置last_ges_record
            gs.last_ges_record[GES_CHN_DOWN_RIGHT]=gs.ges_record[GES_CHN_DOWN_RIGHT];
        
        uint8_t left_up,left_right,right_up;
        //left_up=Ges_Wave_Lead(GES_CHN_DOWN_LEFT,GES_CHN_UP);
        left_right=Ges_Wave_Lead(GES_CHN_DOWN_LEFT,GES_CHN_DOWN_RIGHT);
        //right_up=Ges_Wave_Lead(GES_CHN_DOWN_RIGHT,GES_CHN_UP);
#if 0
        //从左到右
        if ((left_up==GES_CHN_DOWN_LEFT)&&(right_up==GES_CHN_UP))
        {
            res=GES_LEVEL2_RIGHT;
            return res;
        }
        //从右到左
        if ((left_up==GES_CHN_UP)&&(right_up==GES_CHN_DOWN_RIGHT))
        {
            res=GES_LEVEL2_LEFT;
            return res;
        }
        //从上到下
        if ((left_up==GES_CHN_UP)||(right_up==GES_CHN_UP))
        {
            res=GES_LEVEL2_DOWN;
            return res;
        }
        //从下到上
        if ((left_up==GES_CHN_DOWN_LEFT)||(right_up==GES_CHN_DOWN_RIGHT))
        {
            res=GES_LEVEL2_UP;
            return res;
        }
#endif
        //从左到右
        if (left_right==GES_CHN_DOWN_LEFT)
        {
            res=GES_LEVEL2_RIGHT;
            return res;
        }
        //从右到左
        if (left_right==GES_CHN_DOWN_RIGHT)
        {
            res=GES_LEVEL2_LEFT;
            return res;
        }

#if (0)     
        //此次是UP位置
        if (chn&(1<<GES_CHN_UP))
        {
            //从左到右
            if ((gs.last_ges_record[GES_CHN_DOWN_LEFT].add_time<gs.ges_record[GES_CHN_UP].add_time)&&
                (gs.last_ges_record[GES_CHN_DOWN_RIGHT].add_time>gs.ges_record[GES_CHN_UP].add_time)&&
                (gs.last_ges_record[GES_CHN_DOWN_LEFT].add_time+GES_TIME_DIF_MAX>gs.ges_record[GES_CHN_UP].add_time)&&
                (gs.last_ges_record[GES_CHN_DOWN_RIGHT].add_time<gs.ges_record[GES_CHN_UP].add_time+GES_TIME_DIF_MAX))
            {
                res=GES_LEVEL2_RIGHT;
                return res;
            }
            //从右到左
            if ((gs.last_ges_record[GES_CHN_DOWN_RIGHT].add_time<gs.ges_record[GES_CHN_UP].add_time)&&
                (gs.last_ges_record[GES_CHN_DOWN_LEFT].add_time>gs.ges_record[GES_CHN_UP].add_time)&&
                (gs.last_ges_record[GES_CHN_DOWN_RIGHT].add_time+GES_TIME_DIF_MAX>gs.ges_record[GES_CHN_UP].add_time)&&
                (gs.last_ges_record[GES_CHN_DOWN_LEFT].add_time<gs.ges_record[GES_CHN_UP].add_time+GES_TIME_DIF_MAX))
            {
                res=GES_LEVEL2_LEFT;
                return res;
            }
            //从上到下
            if (((gs.last_ges_record[GES_CHN_DOWN_LEFT].add_time<gs.ges_record[GES_CHN_UP].add_time)&&
                (gs.last_ges_record[GES_CHN_DOWN_LEFT].add_time+GES_TIME_DIF_MAX>gs.ges_record[GES_CHN_UP].add_time))||
                ((gs.last_ges_record[GES_CHN_DOWN_RIGHT].add_time<gs.ges_record[GES_CHN_UP].add_time)&&
                (gs.last_ges_record[GES_CHN_DOWN_RIGHT].add_time+GES_TIME_DIF_MAX>gs.ges_record[GES_CHN_UP].add_time)))
            {
                res=GES_LEVEL2_UP;
                return res;
            }
            //从下到上
            if (((gs.last_ges_record[GES_CHN_DOWN_LEFT].add_time>gs.ges_record[GES_CHN_UP].add_time)&&
                (gs.last_ges_record[GES_CHN_DOWN_LEFT].add_time<gs.ges_record[GES_CHN_UP].add_time+GES_TIME_DIF_MAX))||
                ((gs.last_ges_record[GES_CHN_DOWN_RIGHT].add_time>gs.ges_record[GES_CHN_UP].add_time)&&
                (gs.last_ges_record[GES_CHN_DOWN_RIGHT].add_time<gs.ges_record[GES_CHN_UP].add_time+GES_TIME_DIF_MAX)))
            {
                res=GES_LEVEL2_DOWN;
                return res;
            }
        }
        //此次是DOWN_LEFT位置
        if (chn&(1<<GES_CHN_DOWN_LEFT))
        {
            //从左到右
            if ((gs.last_ges_record[GES_CHN_UP].add_time>gs.ges_record[GES_CHN_DOWN_LEFT].add_time)&&
                (gs.last_ges_record[GES_CHN_DOWN_RIGHT].add_time>gs.ges_record[GES_CHN_DOWN_LEFT].add_time)&&
                (gs.last_ges_record[GES_CHN_UP].add_time<gs.ges_record[GES_CHN_UP].add_time+GES_TIME_DIF_MAX)&&
                (gs.last_ges_record[GES_CHN_DOWN_RIGHT].add_time<gs.ges_record[GES_CHN_DOWN_LEFT].add_time+GES_TIME_DIF_MAX))
            {
                res=GES_LEVEL2_RIGHT;
                return res;
            }
            //从右到左
            if ((gs.last_ges_record[GES_CHN_UP].add_time<gs.ges_record[GES_CHN_DOWN_LEFT].add_time)&&
                (gs.last_ges_record[GES_CHN_DOWN_RIGHT].add_time<gs.ges_record[GES_CHN_DOWN_LEFT].add_time)&&
                (gs.last_ges_record[GES_CHN_UP].add_time+GES_TIME_DIF_MAX>gs.ges_record[GES_CHN_DOWN_LEFT].add_time)&&
                (gs.last_ges_record[GES_CHN_DOWN_RIGHT].add_time+GES_TIME_DIF_MAX>gs.ges_record[GES_CHN_DOWN_LEFT].add_time))
            {
                res=GES_LEVEL2_LEFT;
                return res;
            }
            //从上到下
            if ((gs.last_ges_record[GES_CHN_UP].add_time<gs.ges_record[GES_CHN_DOWN_LEFT].add_time)&&
                (gs.last_ges_record[GES_CHN_UP].add_time+GES_TIME_DIF_MAX>gs.ges_record[GES_CHN_DOWN_LEFT].add_time))
            {
                res=GES_LEVEL2_UP;
                return res;
            }
            //从下到上
            if ((gs.last_ges_record[GES_CHN_UP].add_time>gs.ges_record[GES_CHN_DOWN_LEFT].add_time)&&
                (gs.last_ges_record[GES_CHN_UP].add_time<gs.ges_record[GES_CHN_DOWN_LEFT].add_time+GES_TIME_DIF_MAX))
            {
                res=GES_LEVEL2_DOWN;
                return res;
            }
        }
        //此次是DOWN_RIGHT位置
        if (chn&(1<<GES_CHN_DOWN_RIGHT))
        {
            //从左到右
            if ((gs.last_ges_record[GES_CHN_UP].add_time<gs.ges_record[GES_CHN_DOWN_RIGHT].add_time)&&
                (gs.last_ges_record[GES_CHN_DOWN_LEFT].add_time<gs.ges_record[GES_CHN_DOWN_RIGHT].add_time)&&
                (gs.last_ges_record[GES_CHN_UP].add_time+GES_TIME_DIF_MAX>gs.ges_record[GES_CHN_DOWN_RIGHT].add_time)&&
                (gs.last_ges_record[GES_CHN_DOWN_LEFT].add_time+GES_TIME_DIF_MAX>gs.ges_record[GES_CHN_DOWN_RIGHT].add_time))
            {
                res=GES_LEVEL2_RIGHT;
                return res;
            }
            //从右到左
            if ((gs.last_ges_record[GES_CHN_UP].add_time>gs.ges_record[GES_CHN_DOWN_RIGHT].add_time)&&
                (gs.last_ges_record[GES_CHN_DOWN_LEFT].add_time>gs.ges_record[GES_CHN_DOWN_RIGHT].add_time)&&
                (gs.last_ges_record[GES_CHN_UP].add_time<gs.ges_record[GES_CHN_DOWN_RIGHT].add_time+GES_TIME_DIF_MAX)&&
                (gs.last_ges_record[GES_CHN_DOWN_LEFT].add_time<gs.ges_record[GES_CHN_DOWN_RIGHT].add_time+GES_TIME_DIF_MAX))
            {
                res=GES_LEVEL2_LEFT;
                return res;
            }
            //从上到下
            if ((gs.last_ges_record[GES_CHN_UP].add_time<gs.ges_record[GES_CHN_DOWN_RIGHT].add_time)&&
                (gs.last_ges_record[GES_CHN_UP].add_time+GES_TIME_DIF_MAX>gs.ges_record[GES_CHN_DOWN_RIGHT].add_time))
            {
                res=GES_LEVEL2_UP;
                return res;
            }
            //从下到上
            if ((gs.last_ges_record[GES_CHN_UP].add_time>gs.ges_record[GES_CHN_DOWN_RIGHT].add_time)&&
                (gs.last_ges_record[GES_CHN_UP].add_time<gs.ges_record[GES_CHN_DOWN_RIGHT].add_time+GES_TIME_DIF_MAX))
            {
                res=GES_LEVEL2_DOWN;
                return res;
            }
        }
#endif
    }
    
    return res;
}

//对某一帧进行手势分析
//返回：         在此帧中具有的手势类型
uint8_t Ges_DynamicAnalysis(void)
{
    uint8_t i,basic_ges,ges_type,chn=0,hold_flag,full_flag;
    uint16_t index;

    ges_type=GES_NULL;
    chn=0;
    hold_flag=0;
    full_flag=0;

#if (LOG_ENABLE)
    LOG_DEBUG("Ges_DynamicAnalysis sample:%d\r\n",gs.ges_dynamic_sample_size);
#endif

    if(gs.ges_dynamic_sample_size<10)
    {
        overflow_time = 0;
        return ges_type;
    }

    //标准化手势数组
    Ges_DynamicNormalize();

    for (i=0;i<GES_CHN_NUM;i++)
    {
//      basic_ges=Ges_Peak_Find(gs.ges_sample_array[i],i,&index);
//      basic_ges=Ges_Edge_Find(gs.ges_sample_array[i],i,&index);
        basic_ges=Ges_Wave_DynamicSearch(i,&index);
        if (basic_ges==GES_LEVEL1_APPROACH)
        {
            gs.ges_record[i].ges=basic_ges;
            chn|=(1<<i);
#if (LOG_ENABLE)
            LOG_DEBUG("tick: %lld, CHN%d ges: approach!\r\n",gs.ges_record[i].add_time,i);
#endif
        }
        else if (basic_ges==GES_LEVEL1_LEAVE)
        {
            gs.ges_record[i].ges=basic_ges;
            chn|=(1<<i);
#if (LOG_ENABLE)
            LOG_DEBUG("tick: %lld, CHN%d ges: leave!\r\n",gs.ges_record[i].add_time,i);
#endif
        }
        else if (basic_ges==GES_LEVEL1_FULL)
        {
            gs.ges_record[i].ges=basic_ges;
            chn|=(1<<i);
            full_flag++;
#if (LOG_ENABLE)
            LOG_DEBUG("tick: %lld, CHN%d ges: full!\r\n",gs.ges_record[i].add_time,i);
#endif
        }
        else if (basic_ges==GES_LEVEL1_HOLD)
        {
            gs.ges_record[i].ges=basic_ges;
            chn|=(1<<i);
#if (LOG_ENABLE)
            LOG_DEBUG("tick: %lld, CHN%d ges: hold!\r\n",gs.ges_record[i].add_time,i);
#endif
#if(HOLD_GES==1)
            hold_flag++;
#endif
//          res=GES_LEVEL2_HOLD;
//          return res;
        }
    }
    
    //有新的手势
#if(CHN3_GES==0)
    if (chn==0x3)
#else
    if (chn==0x7)
#endif
    {
        LOG_DEBUG("hold %d,full %d,apC %d,leC %d\r\n",hold_flag,full_flag,gs.approach_counter,gs.leave_counter);

#if(HOLD_GES==1)
#if 0//有hold的chn，均判定hold
        if ((hold_flag && !full_flag) || 
            (((gs.approach_counter==0)&&(gs.leave_counter==0))&&
                ((gs.ges_record[GES_CHN_DOWN_LEFT].ges==GES_LEVEL1_APPROACH&&gs.ges_record[GES_CHN_DOWN_RIGHT].ges==GES_LEVEL1_LEAVE)||
                (gs.ges_record[GES_CHN_DOWN_LEFT].ges==GES_LEVEL1_LEAVE&&gs.ges_record[GES_CHN_DOWN_RIGHT].ges==GES_LEVEL1_APPROACH))))
#else
/*
        if ((hold_flag>=2) || 
            (((gs.approach_counter==0)&&(gs.leave_counter==0))&&
            ((hold_flag && !full_flag) || 
                (((gs.ges_record[GES_CHN_DOWN_LEFT].ges==GES_LEVEL1_APPROACH&&
                        gs.ges_record[GES_CHN_DOWN_RIGHT].ges==GES_LEVEL1_LEAVE)||
                    (gs.ges_record[GES_CHN_DOWN_LEFT].ges==GES_LEVEL1_LEAVE&&
                        gs.ges_record[GES_CHN_DOWN_RIGHT].ges==GES_LEVEL1_APPROACH))))))
*/
        if (hold_flag>=2)
#endif
        {
            return GES_LEVEL2_HOLD;
        }
#endif
        //接近和远离判断
        //if ((chn&(1<<GES_CHN_DOWN_LEFT))&&(chn&(1<<GES_CHN_DOWN_RIGHT)))
        {
            if(gs.ges_record[GES_CHN_DOWN_LEFT].ges==GES_LEVEL1_APPROACH &&
                gs.ges_record[GES_CHN_DOWN_RIGHT].ges==GES_LEVEL1_APPROACH)
            {
                return GES_LEVEL2_APPROACH;
            }
            else if(gs.ges_record[GES_CHN_DOWN_LEFT].ges==GES_LEVEL1_LEAVE &&
                gs.ges_record[GES_CHN_DOWN_RIGHT].ges==GES_LEVEL1_LEAVE)
            {
                return GES_LEVEL2_LEAVE;
            }
            
