85hzc/ask_433/stm32f1/Src/App.c
            //一个接近，一个远离，去除抖动
            else if(((gs.ges_record[GES_CHN_DOWN_LEFT].ges==GES_LEVEL1_APPROACH)||
                (gs.ges_record[GES_CHN_DOWN_RIGHT].ges==GES_LEVEL1_APPROACH)) && gs.approach_counter)
            {
                return GES_LEVEL2_APPROACH;
            }
            else if(((gs.ges_record[GES_CHN_DOWN_LEFT].ges==GES_LEVEL1_LEAVE)||
                (gs.ges_record[GES_CHN_DOWN_RIGHT].ges==GES_LEVEL1_LEAVE)) && gs.leave_counter)
            {
                return GES_LEVEL2_LEAVE;
            }
            else if(gs.ges_record[GES_CHN_DOWN_LEFT].ges==GES_LEVEL1_HOLD ||
                gs.ges_record[GES_CHN_DOWN_RIGHT].ges==GES_LEVEL1_HOLD)
            {
                return GES_NULL;
            }
                //只要有接近或者远离的手型，就不做左右判断
            else if((gs.ges_record[GES_CHN_DOWN_LEFT].ges==GES_LEVEL1_LEAVE)||
                (gs.ges_record[GES_CHN_DOWN_RIGHT].ges==GES_LEVEL1_LEAVE) ||
                (gs.ges_record[GES_CHN_DOWN_LEFT].ges==GES_LEVEL1_APPROACH) ||
                (gs.ges_record[GES_CHN_DOWN_RIGHT].ges==GES_LEVEL1_APPROACH))
            {
                return GES_NULL;
            }
        }

        if (chn&(1<<GES_CHN_UP))
            //重置last_ges_record
            gs.last_ges_record[GES_CHN_UP]=gs.ges_record[GES_CHN_UP];
        if (chn&(1<<GES_CHN_DOWN_LEFT))
            //重置last_ges_record
            gs.last_ges_record[GES_CHN_DOWN_LEFT]=gs.ges_record[GES_CHN_DOWN_LEFT];
        if (chn&(1<<GES_CHN_DOWN_RIGHT))
            //重置last_ges_record
            gs.last_ges_record[GES_CHN_DOWN_RIGHT]=gs.ges_record[GES_CHN_DOWN_RIGHT];

#if(CHN3_GES)
        ges_type = Ges_Wave_Calc_3chn(full_flag);
#else
        uint8_t left_up,left_right,right_up;

        //2.two chn lead
        //left_up=Ges_Wave_Lead(GES_CHN_DOWN_LEFT,GES_CHN_UP);
        left_right=Ges_Wave_Lead(GES_CHN_DOWN_LEFT,GES_CHN_DOWN_RIGHT);
        //right_up=Ges_Wave_Lead(GES_CHN_DOWN_RIGHT,GES_CHN_UP);
#if 0
        //从左到右
        if ((left_up==GES_CHN_DOWN_LEFT)&&(right_up==GES_CHN_UP))
        {
            return GES_LEVEL2_RIGHT;
        }
        //从右到左
        if ((left_up==GES_CHN_UP)&&(right_up==GES_CHN_DOWN_RIGHT))
        {
            return GES_LEVEL2_LEFT;
        }
        //从上到下
        if ((left_up==GES_CHN_UP)||(right_up==GES_CHN_UP))
        {
            ges_type=GES_LEVEL2_DOWN;
            return ges_type;
        }
        //从下到上
        if ((left_up==GES_CHN_DOWN_LEFT)||(right_up==GES_CHN_DOWN_RIGHT))
        {
            return GES_LEVEL2_UP;
        }
#endif
        //从左到右
        if (left_right==GES_CHN_DOWN_LEFT)
        {
            return GES_LEVEL2_RIGHT;
        }
        //从右到左
        if (left_right==GES_CHN_DOWN_RIGHT)
        {
            return GES_LEVEL2_LEFT;
        }
#endif
    }
    return ges_type;
}

#if(COMB_GES==1)
#if(CHN3_GES)
void Ges_Comb(uint8_t ges) //3 chn
{
    uint64_t tick=HAL_GetTick();//Systick_Get();

    if(tick>comb_ges.start_ges_time+MULTIGES_DISTANCE_MIN)
    {
        LOG_DEBUG("combination geste tick time lease %d ms, reset.\r\n",MULTIGES_DISTANCE_MIN);
        memset(&comb_ges, 0, sizeof(gs_comb_struct));
    }

    if(comb_ges.gesid==0)//the first ges of combination
        comb_ges.start_ges_time = tick;

    if(comb_ges.gesid<2)
    {
        comb_ges.ges[comb_ges.gesid] = ges;
    }

    LOG_DEBUG("----gesid=[0x%x 0x%x] ----\r\n",comb_ges.ges[0],comb_ges.ges[1]);

    comb_ges.gesid++;

    if(comb_ges.ges[0]==GES_LEVEL2_LEFT&&
        comb_ges.ges[1]==GES_LEVEL2_RIGHT)
    {
        LOG_DEBUG("----left right----\r\n");
        memset(&comb_ges, 0, sizeof(gs_comb_struct));
        //HAL_GPIO_WritePin(LED_LEFT_GPIO_Port, LED_LEFT_Pin, GPIO_PIN_RESET);
        //led_counter=LED_FLASH_DELAY;
        overflow_time = 0;

        if(adjust_type == ADJUST_DOWN)
        {
            adjust_type = ADJUST_UP;
            comb_ges.start_adjust_ges_time = tick;
        }
        else
            lighting_switch = !lighting_switch;
    }
    else if(comb_ges.ges[0]==GES_LEVEL2_RIGHT&&
        comb_ges.ges[1]==GES_LEVEL2_LEFT)
    {
        LOG_DEBUG("----right left----\r\n");
        memset(&comb_ges, 0, sizeof(gs_comb_struct));
        //HAL_GPIO_WritePin(LED_RIGHT_GPIO_Port, LED_RIGHT_Pin, GPIO_PIN_RESET);
        //led_counter=LED_FLASH_DELAY;
        overflow_time = 0;

        if(adjust_type == ADJUST_UP)
        {
            adjust_type = ADJUST_DOWN;
            comb_ges.start_adjust_ges_time = tick;
        }
        else
            lighting_switch = !lighting_switch;
    }
    else if(comb_ges.ges[0]==GES_LEVEL2_LEFT&&
        comb_ges.ges[1]==GES_LEVEL2_LEFT)
    {
        LOG_DEBUG("----left left----\r\n");
        memset(&comb_ges, 0, sizeof(gs_comb_struct));
        //HAL_GPIO_WritePin(LED_LEFT_GPIO_Port, LED_LEFT_Pin, GPIO_PIN_RESET);
        //led_counter=LED_FLASH_DELAY*5;
        overflow_time = 0;
        adjust_type = ADJUST_DOWN;
        comb_ges.start_adjust_ges_time = tick;
    }
    else if(comb_ges.ges[0]==GES_LEVEL2_RIGHT&&
        comb_ges.ges[1]==GES_LEVEL2_RIGHT)
    {
        LOG_DEBUG("----right right----\r\n");
        memset(&comb_ges, 0, sizeof(gs_comb_struct));
        //HAL_GPIO_WritePin(LED_RIGHT_GPIO_Port, LED_RIGHT_Pin, GPIO_PIN_RESET);
        //led_counter=LED_FLASH_DELAY*5;
        overflow_time = 0;
        adjust_type = ADJUST_UP;
        comb_ges.start_adjust_ges_time = tick;
    }
    else if(comb_ges.ges[0]==GES_LEVEL2_UP&&
        comb_ges.ges[1]==GES_LEVEL2_UP)
    {
        LOG_DEBUG("----up up----\r\n");
        memset(&comb_ges, 0, sizeof(gs_comb_struct));
        //HAL_GPIO_WritePin(LED_LEFT_GPIO_Port, LED_LEFT_Pin, GPIO_PIN_RESET);
        //led_counter=LED_FLASH_DELAY*5;
        overflow_time = 0;
        adjust_type = ADJUST_UP;
        comb_ges.start_adjust_ges_time = tick;
    }
    else if(comb_ges.ges[0]==GES_LEVEL2_DOWN&&
        comb_ges.ges[1]==GES_LEVEL2_DOWN)
    {
        LOG_DEBUG("----down down----\r\n");
        memset(&comb_ges, 0, sizeof(gs_comb_struct));
        //HAL_GPIO_WritePin(LED_RIGHT_GPIO_Port, LED_RIGHT_Pin, GPIO_PIN_RESET);
        //led_counter=LED_FLASH_DELAY*5;
        overflow_time = 0;
        adjust_type = ADJUST_DOWN;
        comb_ges.start_adjust_ges_time = tick;
    }
    else if(comb_ges.ges[0]==GES_LEVEL2_UP&&
        comb_ges.ges[1]==GES_LEVEL2_DOWN)
    {
        LOG_DEBUG("----up down----\r\n");
        memset(&comb_ges, 0, sizeof(gs_comb_struct));
        //HAL_GPIO_WritePin(LED_RIGHT_GPIO_Port, LED_RIGHT_Pin, GPIO_PIN_RESET);
        //led_counter=LED_FLASH_DELAY*5;
        overflow_time = 0;
        if(adjust_type == ADJUST_UP)
        {
            adjust_type = ADJUST_DOWN;
            comb_ges.start_adjust_ges_time = tick;
        }
        else
            lighting_switch = !lighting_switch;
    }
    else if(comb_ges.ges[0]==GES_LEVEL2_DOWN&&
        comb_ges.ges[1]==GES_LEVEL2_UP)
    {
        LOG_DEBUG("----down up----\r\n");
        memset(&comb_ges, 0, sizeof(gs_comb_struct));
        //HAL_GPIO_WritePin(LED_RIGHT_GPIO_Port, LED_RIGHT_Pin, GPIO_PIN_RESET);
        //led_counter=LED_FLASH_DELAY*5;
        overflow_time = 0;
        if(adjust_type == ADJUST_DOWN)
        {
            adjust_type = ADJUST_UP;
            comb_ges.start_adjust_ges_time = tick;
        }
        else
            lighting_switch = !lighting_switch;
    }
    else if(comb_ges.ges[0]!=comb_ges.ges[1] &&
            comb_ges.ges[0]!=GES_NULL && 
            comb_ges.ges[1]!=GES_NULL)
    {
        LOG_DEBUG("------------------any case----------------\r\n");
        memset(&comb_ges, 0, sizeof(gs_comb_struct));
        overflow_time = 0;
        if(adjust_type == ADJUST_INIT)
        {
            lighting_switch = !lighting_switch;
        }
    }
}
#else
void Ges_Comb(uint8_t ges)
{
    uint64_t tick=HAL_GetTick();//Systick_Get();

    if(tick>comb_ges.start_ges_time+MULTIGES_DISTANCE_MIN)
    {
        LOG_DEBUG("combination geste tick time lease %d ms, reset.\r\n",MULTIGES_DISTANCE_MIN);
        memset(&comb_ges, 0, sizeof(gs_comb_struct));
    }

    if(comb_ges.gesid==0)//the first ges of combination
        comb_ges.start_ges_time = tick;

