85hzc/ask_433/stm32f1/Src/App.c
#if 0
    if(comb_ges.gesid<3)
    {
        comb_ges.ges[comb_ges.gesid] = ges;
    }

    LOG_DEBUG("        ----gesid=%d %x %x %x----\r\n",comb_ges.gesid,comb_ges.ges[0],comb_ges.ges[1],comb_ges.ges[2]);
    comb_ges.gesid++;

    if(comb_ges.ges[0]==GES_LEVEL2_LEFT&&
        comb_ges.ges[1]==GES_LEVEL2_RIGHT&&
        comb_ges.ges[2]==GES_LEVEL2_LEFT)
    {
        LOG_DEBUG("        ----left----\r\n");
        memset(&comb_ges, 0, sizeof(gs_comb_struct));
        HAL_GPIO_WritePin(LED_LEFT_GPIO_Port, LED_LEFT_Pin, GPIO_PIN_RESET);
        led_counter=LED_FLASH_DELAY;
    }
    if(comb_ges.ges[0]==GES_LEVEL2_RIGHT&&
        comb_ges.ges[1]==GES_LEVEL2_LEFT&&
        comb_ges.ges[2]==GES_LEVEL2_RIGHT)
    {
        LOG_DEBUG("        ----right----\r\n");
        memset(&comb_ges, 0, sizeof(gs_comb_struct));
        HAL_GPIO_WritePin(LED_RIGHT_GPIO_Port, LED_RIGHT_Pin, GPIO_PIN_RESET);
        led_counter=LED_FLASH_DELAY;
    }
#else
    if(comb_ges.gesid<2)
    {
        comb_ges.ges[comb_ges.gesid] = ges;
    }

    LOG_DEBUG("----gesid=[0x%x 0x%x] ----\r\n",comb_ges.ges[0],comb_ges.ges[1]);
    comb_ges.gesid++;

    if(comb_ges.ges[0]==GES_LEVEL2_LEFT&&
        comb_ges.ges[1]==GES_LEVEL2_RIGHT)
    {
        LOG_DEBUG("----left right----\r\n");
        memset(&comb_ges, 0, sizeof(gs_comb_struct));
        overflow_time = 0;
        if(adjust_type == ADJUST_DOWN)
        {
            adjust_type = ADJUST_UP;
            comb_ges.start_adjust_ges_time = tick;
        }
        else
            lighting_switch = !lighting_switch;
    }
    else if(comb_ges.ges[0]==GES_LEVEL2_RIGHT&&
        comb_ges.ges[1]==GES_LEVEL2_LEFT)
    {
        LOG_DEBUG("----right left----\r\n");
        memset(&comb_ges, 0, sizeof(gs_comb_struct));
        overflow_time = 0;
        if(adjust_type == ADJUST_UP)
        {
            adjust_type = ADJUST_DOWN;
            comb_ges.start_adjust_ges_time = tick;
        }
        else
            lighting_switch = !lighting_switch;

    }
    else if(comb_ges.ges[0]==GES_LEVEL2_LEFT&&
        comb_ges.ges[1]==GES_LEVEL2_LEFT)
    {
        LOG_DEBUG("----left left----\r\n");
        memset(&comb_ges, 0, sizeof(gs_comb_struct));
        overflow_time = 0;
        adjust_type = ADJUST_DOWN;
        comb_ges.start_adjust_ges_time = tick;
    }
    else if(comb_ges.ges[0]==GES_LEVEL2_RIGHT&&
        comb_ges.ges[1]==GES_LEVEL2_RIGHT)
    {
        LOG_DEBUG("----right right----\r\n");
        memset(&comb_ges, 0, sizeof(gs_comb_struct));
        overflow_time = 0;
        adjust_type = ADJUST_UP;
        comb_ges.start_adjust_ges_time = tick;
    }
#endif
}
#endif
#endif

#if(!CALIB_OBO)
//手势基准定标，采用平均值定标
void Ges_Calib(uint8_t firstboot)
{
    uint8_t i;
    uint16_t j,delta;
    uint32_t sum;

#if (LOG_ENABLE)
    LOG_DEBUG("Ges_Calib");
#endif

#if 1
    if(gs.sample_size == GES_SAMPLE_ARRAY_NUM_S)
    {
        for (i=0;i<GES_CHN_NUM;i++)
        {
            sum=0;
            for (j=0;j<GES_SAMPLE_ARRAY_NUM_S;j++)
            {
                sum+=gs.ges_sample_array[i][j];
            }
            delta=(uint16_t)(sum/GES_SAMPLE_ARRAY_NUM_S);
            //delta=(uint16_t)(sum>>3);

            if(firstboot)
                gs.sample_base_last[i]=delta;
            else
                gs.sample_base_last[i] = gs.sample_base[i];

            gs.sample_base[i]=delta;
            //gs.sample_down_limit[i]=SAMPLE_DOWN_LIMIT_DEF+delta;
            //gs.sample_up_limit[i]=SAMPLE_UP_LIMIT_DEF+delta;
        }
#if (LOG_ENABLE)
        //LOG_DEBUG("CHN %d-> base: %d,down_limit: %d,up limit: %d\r\n",i,gs.sample_base[i],gs.sample_down_limit[i],gs.sample_up_limit[i]);
        //LOG_DEBUG("CHN%d: cur[%d] new[%d]\r\n",i,gs.sample_base_last[i],gs.sample_base[i]);
#if CHN3_GES
        LOG_DEBUG("[%d %d %d]",gs.sample_base_last[1],gs.sample_base_last[2],gs.sample_base_last[0]);
#else
        LOG_DEBUG("[%d %d]",gs.sample_base_last[1],gs.sample_base_last[0]);
#endif
#endif
    }

#if (LOG_ENABLE)
    LOG_DEBUG("\r\n");
#endif

#else
    for (i=0;i<GES_CHN_NUM;i++)
    {
        sum=0;
        for (j=0;j<gs.sample_size;j++)
        {
            sum+=gs.ges_sample_array[i][j];
        }
        if(gs.sample_size == GES_SAMPLE_ARRAY_NUM_L)
        {
            delta=(uint16_t)(sum>>5);
            //delta=(uint16_t)(sum>>5)+(((sum%GES_SAMPLE_ARRAY_NUM_L)>=(GES_SAMPLE_ARRAY_NUM_L/2))?1:0);
        }
        else
        {
            delta=(uint16_t)(sum>>3);
            //delta=(uint16_t)(sum>>3)+(((sum%GES_SAMPLE_ARRAY_NUM_S)>=(GES_SAMPLE_ARRAY_NUM_S/2))?1:0);
        }

        if(firstboot)
            gs.sample_base_last[i]=delta;
        else
            gs.sample_base_last[i] = gs.sample_base[i];
        
        gs.sample_base[i]=delta;

#if (LOG_ENABLE)
        //LOG_DEBUG("CHN %d-> base: %d,down_limit: %d,up limit: %d\r\n",i,gs.sample_base[i],gs.sample_down_limit[i],gs.sample_up_limit[i]);
        //LOG_DEBUG("CHN %d-> base: %d %d\r\n",i,gs.sample_base_last[i],gs.sample_base[i]);
#endif
    }
#endif
}

//手势基准定标，采用平均值定标
void Ges_DynamicCalib()
{
    uint8_t i;
    uint16_t j,delta;
    uint32_t sum;

#if (LOG_ENABLE)
    LOG_DEBUG("Ges_DynamicCalib\r\n");
#endif

    for (i=0;i<GES_CHN_NUM;i++)
    {
        sum=0;
        for (j=0;j<GES_SAMPLE_ARRAY_NUM_S;j++)
        {
            sum+=gs.ges_dynamic_sample_array[i][j];
        }
        delta=(uint16_t)(sum/GES_SAMPLE_ARRAY_NUM_S);
        //gs.sample_base_last[i] = gs.sample_base[i];
        gs.sample_base[i]=delta;
        gs.sample_base_last[i] = delta;
#if (LOG_ENABLE)
        LOG_DEBUG("CHN%d[%d]\r\n",i,gs.sample_base_last[i]);
#endif
    }
}

//归一化采样数组
void Ges_Normalize(void)
{
    uint8_t i,j;
    for (i=0;i<GES_CHN_NUM;i++)
    {
        for (j=0;j<gs.sample_size;j++)
        {
        
            if (gs.ges_sample_array[i][j]>=gs.sample_base_last[i]) {
                gs.ges_sample_array[i][j]=gs.ges_sample_array[i][j]-gs.sample_base_last[i];
            }
            else {
                gs.ges_sample_array[i][j]=0;
                //gs.ges_sample_array[i][j]=gs.sample_base_last[i]-gs.ges_sample_array[i][j];
            }
        }
    }

#if (LOG_ENABLE)
    //for (j=0;j<gs.sample_size;j++)
    {
        //LOG_DEBUG(" %5d %5d %5d\r\n",
    //        gs.ges_sample_array[1][j],gs.ges_sample_array[2][j],gs.ges_sample_array[0][j]);
    }
    LOG_DEBUG("base[%5d %5d %5d] sample[%d]\r\n",gs.sample_base_last[1],gs.sample_base_last[2],gs.sample_base_last[0],gs.sample_size);
#endif
}
#endif


//归一化采样数组
void Ges_DynamicNormalize(void)
{
    uint8_t i,j;
    for (i=0;i<GES_CHN_NUM;i++)
    {
        for (j=0;j<gs.ges_dynamic_sample_size;j++)
        {
        
            if (gs.ges_dynamic_sample_array[i][j]>=gs.sample_base_last[i]) {
                gs.ges_dynamic_sample_array[i][j]=gs.ges_dynamic_sample_array[i][j]-gs.sample_base_last[i];
                //gs.sample_mode = POSITIVE;
            }
            else {
                //gs.ges_dynamic_sample_array[i][j]=0;
                gs.ges_dynamic_sample_array[i][j]=gs.sample_base_last[i]-gs.ges_dynamic_sample_array[i][j];
                //gs.sample_mode = NEGATIVE;
            }
        }
    }

#if (LOG_ENABLE)
/*
    for (j=0;j<gs.ges_dynamic_sample_size;j++)
    {
        LOG_DEBUG("     ges[%d]:[ %5d  %5d]\r\n",j,
            gs.ges_dynamic_sample_array[1][j],gs.ges_dynamic_sample_array[0][j]);
    }
*/
#if(CHN3_GES)
    LOG_DEBUG("Normalize[%5d %5d %5d]\r\n",
        gs.sample_base_last[1],gs.sample_base_last[2],gs.sample_base_last[0]);
#else
    LOG_DEBUG("Normalize[%5d %5d]\r\n",
        gs.sample_base_last[1],gs.sample_base_last[0]);
#endif
#endif
}

#if(CALIB_OBO)
//归一化采样数组
void Ges_Normalize_OneBOne(uint16_t *ps)
{
    uint8_t i;

#if (LOG_ENABLE)
    LOG_DEBUG("%5d  %5d  %5d  ", ps[1],ps[2],ps[0]);
#endif

    for (i=0;i<GES_CHN_NUM;i++)
    {
        if (ps[i]>=gs.sample_base_last[i]) {
            ps[i]=ps[i]-gs.sample_base_last[i];
        }
        else {
            ps[i]=0;
            //ps[i]=gs.sample_base_last[i]-ps[i];
        }
    }

#if (LOG_ENABLE)
    LOG_DEBUG(" %5d %5d %5d base:[%5d %5d %5d]\r\n",
                    ps[1],ps[2],ps[0],
                    gs.sample_base_last[1],gs.sample_base_last[2],gs.sample_base_last[0]);
                    //ps[1]<=gs.sample_base[1]?gs.sample_base[1]-ps[1]:ps[1]-gs.sample_base[1],
                    //ps[2]<=gs.sample_base[2]?gs.sample_base[2]-ps[2]:ps[2]-gs.sample_base[2],
                    //ps[0]<=gs.sample_base[0]?gs.sample_base[0]-ps[0]:ps[0]-gs.sample_base[0]);
#endif
}

//手势基准定标，采用实时平均值
uint8_t Ges_CalibOneBOne(uint16_t *ps)
{
    uint8_t i;
    uint16_t j,delta;
    uint32_t sum;
    uint16_t temp;
    static uint8_t arrayIndex = 0;

    if(gs.hold_counter!=0)
        goto NORMALIZE;

    if(arrayIndex==GES_SAMPLE_ARRAY_FULL)
    {
        for (i=0;i<GES_CHN_NUM;i++)
        {
            for (j=0;j<GES_SAMPLE_ARRAY_NUM_L-1;j++)
            {
                gs.ges_sample_Calib_array[i][j] = gs.ges_sample_Calib_array[i][j+1];
            }
            gs.ges_sample_Calib_array[i][j] = ps[i];
        }
    } else {
        for (i=0;i<GES_CHN_NUM;i++)
        {
            gs.ges_sample_Calib_array[i][arrayIndex] = ps[i];
        }
        arrayIndex++;
        //return 1;
    }

    for (i=0;i<GES_CHN_NUM;i++)
    {
        sum=0;
        for (j=0;j<GES_SAMPLE_ARRAY_NUM_L;j++)
        {
            //LOG_DEBUG("CHN %d-> base: [%d] %d\r\n",i,j,gs.ges_sample_Calib_array[i][j]);
            sum+=gs.ges_sample_Calib_array[i][j];
        }

        delta=(uint16_t)(sum>>5);

        gs.sample_base_last[i]=delta;
        gs.sample_base[i]=delta;
#if (LOG_ENABLE)
        //LOG_DEBUG("CHN %d-> base: %d,down_limit: %d,up limit: %d\r\n",i,gs.sample_base[i],gs.sample_down_limit[i],gs.sample_up_limit[i]);
        //LOG_DEBUG("CHN %d-> base: %d %d\r\n",i,gs.sample_base_last[i],gs.sample_base[i]);
#endif
    }

NORMALIZE:
    Ges_Normalize_OneBOne(ps);

