85hzc/ask_433/stm32f1/Src/App.c
    return 0;
}
#endif


////判断是否需要改变sample_size并改变
////返回值：    0-->    不需要改变
////            1-->    需要改变
//uint8_t Ges_SampleSize_Switch(void)
//{
//  uint16_t i;
//  for (i=0;i<gs.sample_size;i++)
//  {
//      
//  }
//}

//打印相关手势信息
void Ges_Log(void)
{
#if 0//(LOG_ENABLE)
    LOG_DEBUG("this ges-->up: %lld/%d, down_left: %lld/%d, down_right: %lld/%d!\r\n",
                gs.ges_record[GES_CHN_UP].add_time,gs.ges_record[GES_CHN_UP].ges,
                gs.ges_record[GES_CHN_DOWN_LEFT].add_time,gs.ges_record[GES_CHN_DOWN_LEFT].ges,
                gs.ges_record[GES_CHN_DOWN_RIGHT].add_time,gs.ges_record[GES_CHN_DOWN_RIGHT].ges);

    LOG_DEBUG("last ges-->up: %d.%d/%d, down_left: %d.%d/%d, down_right: %d.%d/%d!\r\n",
                (uint32_t)(gs.last_ges_record[GES_CHN_UP].add_time/1000),(uint32_t)(gs.last_ges_record[GES_CHN_UP].add_time%1000),gs.last_ges_record[GES_CHN_UP].ges,
                (uint32_t)(gs.last_ges_record[GES_CHN_DOWN_LEFT].add_time/1000),(uint32_t)(gs.last_ges_record[GES_CHN_DOWN_LEFT].add_time%1000),gs.last_ges_record[GES_CHN_DOWN_LEFT].ges,
                (uint32_t)(gs.last_ges_record[GES_CHN_DOWN_RIGHT].add_time/1000),(uint32_t)(gs.last_ges_record[GES_CHN_DOWN_RIGHT].add_time%1000),gs.last_ges_record[GES_CHN_DOWN_RIGHT].ges);  
    LOG_DEBUG("CHN DOWN LEFT  rise_index: %d,peak_index: %d,fall_index: %d\r\n",gs.wave[GES_CHN_DOWN_LEFT].rise_index,gs.wave[GES_CHN_DOWN_LEFT].peak_index,gs.wave[GES_CHN_DOWN_LEFT].fall_index);
    LOG_DEBUG("CHN UP         rise_index: %d,peak_index: %d,fall_index: %d\r\n",gs.wave[GES_CHN_UP].rise_index,gs.wave[GES_CHN_UP].peak_index,gs.wave[GES_CHN_UP].fall_index);
    LOG_DEBUG("CHN DOWN RIGHT rise_index: %d,peak_index: %d,fall_index: %d\r\n",gs.wave[GES_CHN_DOWN_RIGHT].rise_index,gs.wave[GES_CHN_DOWN_RIGHT].peak_index,gs.wave[GES_CHN_DOWN_RIGHT].fall_index);
    LOG_DEBUG("\n");

    uint8_t i,j;
    for (i=0;i<GES_CHN_NUM;i++)
    {
//          LOG_DEBUG("CHN%d raw array: ",i);
//          for (j=0;j<GES_SAMPLE_RAW_ARRAY_NUM;j++)
//          {
//              LOG_DEBUG("%d ",gs.ges_sample_raw_array[i][j]);
//          }
//          LOG_DEBUG("\n");
        if (i==GES_CHN_UP)
            LOG_DEBUG("UP    array:");
        else if (i==GES_CHN_DOWN_LEFT)
            LOG_DEBUG("LEFT  array:");
        else if (i==GES_CHN_DOWN_RIGHT)
            LOG_DEBUG("RIGHT array:");
        for (j=0;j<gs.ges_dynamic_sample_size;j++)
        {
            //打印去除基准值的归一化数组
            if (gs.ges_dynamic_sample_array[i][j]>=gs.sample_down_limit[i])
                LOG_DEBUG("%d ",gs.ges_dynamic_sample_array[i][j]-gs.sample_down_limit[i]);
            else
                LOG_DEBUG("%d ",0);
//              LOG_DEBUG("%d ",gs.ges_sample_array[i][j]);
        }
        LOG_DEBUG("\r\n");
    }
#endif  
}

//主任务
void App_Task(void)
#if 0
{
    //static uint8_t calib_num=0;
    static uint8_t firstboot=1;
    /*
    if (gs.sample_start_flag==1)
    {
        gs.sample_start_flag=0;
        VCNL4035_StartGesDetect();
//      LOG_DEBUG("ges detect!\n");
    }*/
    //if (gs.sample_ready_flag==1)
    {
        uint16_t ps[3];
        uint8_t res;

        memset(ps,0,sizeof(ps));
        gs.sample_ready_flag=0;
        //VCNL4035_ReadPS(ps);
        //VCNL4035_ClearInt();
        getSensorDataByHostout(ps);

        if(!ps[0]&&!ps[1]&&!ps[2])
        {
            LOG_DEBUG(">>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\r\n");
            return;
        }
#if(CALIB_OBO)
        Ges_CalibOneBOne(ps);
#endif
        res=Ges_Add_Sample(ps);
        //一次数组填充完毕
        if (res==1)
        {
//#if (LOG_ENABLE)
#if(CALIB_OBO)
            LOG_DEBUG("sample[%d]\r\n",gs.sample_size);
#endif
//#endif
            //第一次采样数据作为定标用
            //if (!calib_num)
            //if(GES_SAMPLE_ARRAY_NUM_S==gs.sample_size)
#if(!CALIB_OBO)
            if(0==gs.hold_counter)
            {
                Ges_Calib(firstboot);
                firstboot = 0;
                //calib_num++;
                //return;
            }
#endif
#if (!LOG_ENABLE)
            LOG_DEBUG("sample[%d] %x[13L 14R 15H 17A 18LE]\r\n",gs.sample_size,gs.last_ges);
#endif
            res=Ges_Analysis();
            if (res)//else return to 10 samples
            {
                //当前是short采样，改变sample_size继续采样
                if (gs.sample_size==GES_SAMPLE_ARRAY_NUM_S)
                {
                    gs.sample_size=GES_SAMPLE_ARRAY_NUM_L;
                    gs.sample_size_raw=GES_SAMPLE_RAW_ARRAY_NUM_L;
                    gs.ges_sample_raw_cur=GES_SAMPLE_ARRAY_NUM_S;
                    return;
                }

                uint64_t tick=Systick_Get();
                
                //上次是HOLD手势,此次不是HOLD且不为空，避免误触发,但是hold之后，要允许leave和approach
                if ((gs.last_ges==GES_LEVEL2_HOLD)&&(res!=GES_LEVEL2_HOLD)&&
                    (res!=GES_LEVEL2_APPROACH)&&(res!=GES_LEVEL2_LEAVE))
                {
                    LOG_DEBUG("######IGNORE [%x] after GES_LEVEL2_HOLD#######\r\n",res);
                    gs.last_ges=GES_NULL;
                    gs.last_ges_time=tick;
                    return;
                }

                //上次是APPROACH or LEAVE手势,此次是LEFT or RIGHT，避免误触发
                if (((gs.last_ges==GES_LEVEL2_APPROACH) || (gs.last_ges==GES_LEVEL2_LEAVE)) && 
                    ((res==GES_LEVEL2_LEFT)||(res==GES_LEVEL2_RIGHT)))
                {
                    LOG_DEBUG("######IGNORE [%x] after [%s]#######\r\n",res,(gs.last_ges==GES_LEVEL2_APPROACH)?"APPROACH":"LEAVE");
                    gs.last_ges=GES_NULL;
                    gs.last_ges_time=tick;
                    return;
                }

                //有效手势更新
                if (tick>gs.last_ges_time+GES_DISTANCE_MIN)
                {
                    //if(!gs.hold_saveself)
                        gs.last_ges=res;
                    gs.last_ges_time=tick;
                }
                else//无效手势，间隔过短
                {
                    #if 0//实现连续手势，取消间隔700ms手势过滤
                    //连续触发接近或者离开手势
                    if((gs.last_ges == GES_LEVEL2_LEAVE && res == GES_LEVEL2_LEAVE) ||
                        (gs.last_ges == GES_LEVEL2_APPROACH && res == GES_LEVEL2_APPROACH))
                    {
                        gs.last_ges=res;
                        gs.last_ges_time=tick;
                    }
                    else
                    {
                        if(!(gs.last_ges == GES_LEVEL2_HOLD && res == GES_LEVEL2_LEAVE))
                        {
                            LOG_DEBUG("tick time lease %d ms\r\n",GES_DISTANCE_MIN);
                            return;
                        }
                        else
                        {
                            gs.last_ges=res;
                            gs.last_ges_time=tick;
                        }
                    }
                    #else
                        gs.last_ges=res;
                        gs.last_ges_time=tick;
                        if(!(gs.last_ges == GES_LEVEL2_HOLD && res == GES_LEVEL2_LEAVE))
                        {
                            LOG_DEBUG("          tick time lease %d ms\r\n",GES_DISTANCE_MIN);
                        //    return;
                        }
                    #endif
                }

                if (res==GES_LEVEL2_UP)
                {
                    HAL_GPIO_WritePin(LED_UP_GPIO_Port, LED_UP_Pin, GPIO_PIN_RESET);
                    led_counter=LED_FLASH_DELAY;
                    LOG_DEBUG("          Ges: UP!\r\n");
                    Ges_Log();
                    //开SW2
                    //HAL_GPIO_WritePin(SW2_GPIO_Port, SW2_Pin, GPIO_PIN_SET);
                }
                else if (res==GES_LEVEL2_DOWN)
                {
                    HAL_GPIO_WritePin(LED_DOWN_GPIO_Port, LED_DOWN_Pin, GPIO_PIN_RESET);
                    led_counter=LED_FLASH_DELAY;
                    LOG_DEBUG("          Ges: DOWN!\r\n");
                    Ges_Log();
                    //关SW2
                    //HAL_GPIO_WritePin(SW2_GPIO_Port, SW2_Pin, GPIO_PIN_RESET);
                }
                else if (res==GES_LEVEL2_LEFT)
                {
#if(COMB_GES==0)
                    HAL_GPIO_WritePin(LED_LEFT_GPIO_Port, LED_LEFT_Pin, GPIO_PIN_RESET);
                    led_counter=LED_FLASH_DELAY;
#endif
                    LOG_DEBUG("          Ges: LEFT!\r\n");
#if(COMB_GES==1)
                    Ges_Comb(GES_LEVEL2_LEFT);
#endif
                    Ges_Log();
                    //关SW1
                    //HAL_GPIO_WritePin(SW1_GPIO_Port, SW1_Pin, GPIO_PIN_RESET);
                }
                else if (res==GES_LEVEL2_RIGHT)
                {
#if(COMB_GES==0)
                    HAL_GPIO_WritePin(LED_RIGHT_GPIO_Port, LED_RIGHT_Pin, GPIO_PIN_RESET);
                    led_counter=LED_FLASH_DELAY;
#endif
                    LOG_DEBUG("          Ges: RIGHT!\r\n");
#if(COMB_GES==1)
                    Ges_Comb(GES_LEVEL2_RIGHT);
#endif
                    Ges_Log();
                    //开SW1
                    //HAL_GPIO_WritePin(SW1_GPIO_Port, SW1_Pin, GPIO_PIN_SET);
                }
#if(HOLD_GES==1)
                else if (res==GES_LEVEL2_HOLD)
                {
                    static uint8_t sw_state=0;
                    
//                  gs.hold_counter++;
//                  if (gs.hold_counter==0)
//                  {
//                      HAL_GPIO_WritePin(LED_HOLD_GPIO_Port, LED_HOLD_Pin, GPIO_PIN_SET);
//                      led_counter=LED_FLASH_DELAY;
//                      LOG_DEBUG("Ges: HOLD!\n");
//                      Ges_Log();
//                      if (!sw_state)
//                      {
//                          HAL_GPIO_WritePin(SW1_GPIO_Port, SW1_Pin, GPIO_PIN_SET);
//                          HAL_GPIO_WritePin(SW2_GPIO_Port, SW2_Pin, GPIO_PIN_SET);
//                          sw_state=1;
//                      }
//                      else
//                      {
//                          HAL_GPIO_WritePin(SW1_GPIO_Port, SW1_Pin, GPIO_PIN_RESET);
//                          HAL_GPIO_WritePin(SW2_GPIO_Port, SW2_Pin, GPIO_PIN_RESET);
//                          sw_state=0;
//                      }
//                  }
                    //if (gs.hold_counter<SAMPLE_HOLD_COUNT)
                    //{
                        gs.hold_counter++;
                        if (gs.hold_counter==SAMPLE_HOLD_COUNT)
                        {
                            //HAL_GPIO_WritePin(LED_HOLD_GPIO_Port, LED_HOLD_Pin, GPIO_PIN_RESET);
                            HAL_GPIO_WritePin(LED_LEFT_GPIO_Port, LED_LEFT_Pin, GPIO_PIN_RESET);
                            HAL_GPIO_WritePin(LED_RIGHT_GPIO_Port, LED_RIGHT_Pin, GPIO_PIN_RESET);
                            HAL_GPIO_WritePin(LED_UP_GPIO_Port, LED_UP_Pin, GPIO_PIN_RESET);
                            HAL_GPIO_WritePin(LED_DOWN_GPIO_Port, LED_DOWN_Pin, GPIO_PIN_RESET);
                            led_counter=LED_FLASH_DELAY;
                            LOG_DEBUG("                         Ges: HOLD!\r\n");
                            Ges_Log();
                            if (!sw_state)
                            {
                                //HAL_GPIO_WritePin(SW1_GPIO_Port, SW1_Pin, GPIO_PIN_SET);
                                //HAL_GPIO_WritePin(SW2_GPIO_Port, SW2_Pin, GPIO_PIN_SET);
                                sw_state=1;
                            }
                            else
                            {
                                //HAL_GPIO_WritePin(SW1_GPIO_Port, SW1_Pin, GPIO_PIN_RESET);
                                //HAL_GPIO_WritePin(SW2_GPIO_Port, SW2_Pin, GPIO_PIN_RESET);
                                sw_state=0;
                            }
                        }
                    //}

                    if(gs.hold_counter>5)
                    {
                        if (gs.sample_size==GES_SAMPLE_ARRAY_NUM_L)
                        {
                            gs.sample_size=GES_SAMPLE_ARRAY_NUM_S;
                            gs.sample_size_raw=GES_SAMPLE_RAW_ARRAY_NUM_S;
                        }
                        gs.last_ges = GES_NULL;
                        gs.hold_counter=0;
                    }
                }
#endif
                else if (res==GES_LEVEL2_DCLK)
                {
                    HAL_GPIO_WritePin(LED_DCLK_GPIO_Port, LED_DCLK_Pin, GPIO_PIN_RESET);
                    led_counter=LED_FLASH_DELAY;
                    LOG_DEBUG("                         Ges: DCLK!\r\n");
                    Ges_Log();
                }
                else if (res==GES_LEVEL2_APPROACH)
                {
                    if(gs.approach_counter)
                    {
                        LOG_DEBUG("                         Ges: APPROACH!\r\n");
                        HAL_GPIO_WritePin(LED_UP_GPIO_Port, LED_UP_Pin, GPIO_PIN_RESET);
                        led_counter=100;
                        Ges_Log();
                    }
                    gs.approach_counter++;
                }
                else if (res==GES_LEVEL2_LEAVE)
                {
                    LOG_DEBUG("                         Ges: LEAVE!\r\n");
                    HAL_GPIO_WritePin(LED_DOWN_GPIO_Port, LED_DOWN_Pin, GPIO_PIN_RESET);
                    led_counter=100;
                    Ges_Log();
                }
            }
            else
            {
                //当前是long采样，改变sample_size继续采样
                if (gs.sample_size==GES_SAMPLE_ARRAY_NUM_L)
                {
                    gs.sample_size=GES_SAMPLE_ARRAY_NUM_S;
                    gs.sample_size_raw=GES_SAMPLE_RAW_ARRAY_NUM_S;
                    return;
                }
                gs.last_ges = GES_NULL;
                gs.hold_counter=0;
                gs.approach_counter=0;
                //HAL_GPIO_WritePin(LED_HOLD_GPIO_Port, LED_HOLD_Pin, GPIO_PIN_RESET);
            }
#if (LOG_ENABLE)
            LOG_DEBUG("\r\n\n");
#endif
        }
    }
}
#else
{
    uint16_t ps[3];
    uint8_t res;
    //static uint8_t calib_num=0;

    memset(ps,0,sizeof(ps));

