85hzc/ask_433/stm32f1/Src/App.c
    getSensorDataByHostout(ps);

    if(!ps[0]&&!ps[1]&&!ps[2])
    {
        LOG_DEBUG(">>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>\r\n");
        return;
    }

    if(gs.ges_dynamic_start==false)
    {
        res=Ges_Add_Sample(ps);
        //一次数组填充完毕
        if (res==1)
        {
            if (gs.hold_flag && 
                (gs.frame_start_tick>gs.last_ges_time+GES_TREND_CLEARUP_MIN))
            {
                gs.last_ges = GES_NULL;
                init_counter();
            }

            //第一次采样数据作为定标用
            //if(GES_SAMPLE_ARRAY_NUM_S==gs.sample_size)
            if(/*false==gs.hold_flag && */gs.ges_dynamic_start==false/*) || gs.calib_force*/)
            {
                Ges_Calib(firstboot);
                firstboot = false;
                //gs.calib_force = false;
                //calib_num++;
                //return;
            }
        }
    }
    if(firstboot)
        return;

    res = Ges_Detect_Sample(ps);
    if(!res)//当前手势过程不完整，继续采样
        return;

    res=Ges_DynamicAnalysis();
    if (res != GES_NULL)//else return to 10 samples
    {
        uint64_t tick=HAL_GetTick();//Systick_Get();

        // keep 2000ms 
        if(tick>comb_ges.start_adjust_ges_time+ADJUSTIGES_DISTANCE_MIN)
        {
            LOG_DEBUG("start_adjust_ges_time lease %d ms, reset.\r\n",ADJUSTIGES_DISTANCE_MIN);
            adjust_type = ADJUST_INIT;
        }

        //上次是HOLD手势,此次不是HOLD且不为空，避免误触发,但是hold之后，要允许leave和approach
        if ((gs.last_ges==GES_LEVEL2_HOLD)&&(res!=GES_LEVEL2_HOLD)&&
            (res!=GES_LEVEL2_APPROACH)&&(res!=GES_LEVEL2_LEAVE))
        {
            LOG_DEBUG("######IGNORE [0x%x] after GES_LEVEL2_HOLD#######\r\n",res);
            gs.last_ges=GES_NULL;
            gs.last_ges_time=tick;
            init_counter();
            return;
        }

        //上次是APPROACH or LEAVE手势,此次是LEFT or RIGHT，避免误触发
        if (((gs.last_ges==GES_LEVEL2_APPROACH) || (gs.last_ges==GES_LEVEL2_LEAVE)) && 
            ((res==GES_LEVEL2_LEFT)||(res==GES_LEVEL2_RIGHT)))
        {
            LOG_DEBUG("######IGNORE [0x%x] after [%s]#######\r\n",res,(gs.last_ges==GES_LEVEL2_APPROACH)?"APPROACH":"LEAVE");
            gs.last_ges=GES_NULL;
            gs.last_ges_time=tick;
            init_counter();
            return;
        }

        //上次是APPROACH手势,此次是leave相反，避免接近过程结束的误触发
        if ((gs.last_ges==GES_LEVEL2_APPROACH) && (res==GES_LEVEL2_LEAVE))
        {
            LOG_DEBUG("######IGNORE [LEAVE] after [APPROACH]#######\r\n");
            gs.last_ges=GES_NULL;
            gs.last_ges_time=tick;
            init_counter();
            return;
        }

        //有效手势更新
        if (tick>gs.last_ges_time+GES_DISTANCE_MIN)
        {
            //if(!gs.hold_saveself)
                gs.last_ges=res;
            gs.last_ges_time=tick;
        }
        else//无效手势，间隔过短
        {
            #if 0//实现连续手势，取消间隔700ms手势过滤
            //连续触发接近或者离开手势
            if((gs.last_ges == GES_LEVEL2_LEAVE && res == GES_LEVEL2_LEAVE) ||
                (gs.last_ges == GES_LEVEL2_APPROACH && res == GES_LEVEL2_APPROACH))
            {
                gs.last_ges=res;
                gs.last_ges_time=tick;
            }
            else
            {
                if(!(gs.last_ges == GES_LEVEL2_HOLD && res == GES_LEVEL2_LEAVE))
                {
                    LOG_DEBUG("tick time lease %d ms\r\n",GES_DISTANCE_MIN);
                    return;
                }
                else
                {
                    gs.last_ges=res;
                    gs.last_ges_time=tick;
                }
            }
            #else
                gs.last_ges=res;
                gs.last_ges_time=tick;
                if(!(gs.last_ges == GES_LEVEL2_HOLD && res == GES_LEVEL2_LEAVE))
                {
                    LOG_DEBUG("tick time lease less than %d ms, and go on.\r\n",GES_DISTANCE_MIN);
                    //return;
                }
            #endif
        }

        if (res==GES_LEVEL2_UP)
        {
            LOG_DEBUG("[UP] adjust:%d\r\n",adjust_type);
#if(COMB_GES==0)
            HAL_GPIO_WritePin(LED_UP_GPIO_Port, LED_UP_Pin, GPIO_PIN_RESET);
            led_counter=LED_FLASH_DELAY;
#else
            Ges_Comb(GES_LEVEL2_UP);
#endif

            if(adjust_type != ADJUST_INIT)
            {
                if(lighting_status_now)
                    PLUS(brightness,STEP);
                comb_ges.start_adjust_ges_time = tick;
                comb_ges.gesid = 0;
            }
            /*else if(adjust_type == ADJUST_DOWN)
            {
                if(lighting_status_now)
                    MINUS(brightness,STEP);
                comb_ges.start_adjust_ges_time = tick;
            }*/
            Ges_Log();
        }
        else if (res==GES_LEVEL2_DOWN)
        {
            LOG_DEBUG("[DOWN] adjust:%d\r\n",adjust_type);
#if(COMB_GES==0)
            HAL_GPIO_WritePin(LED_DOWN_GPIO_Port, LED_DOWN_Pin, GPIO_PIN_RESET);
            led_counter=LED_FLASH_DELAY;
#else
            Ges_Comb(GES_LEVEL2_DOWN);
#endif

            if(adjust_type != ADJUST_INIT)
            {
                if(lighting_status_now)
                    MINUS(brightness,STEP);
                comb_ges.start_adjust_ges_time = tick;
                comb_ges.gesid = 0;
            }
            /*else if(adjust_type == ADJUST_UP)
            {
                if(lighting_status_now)
                    PLUS(brightness,STEP);
                comb_ges.start_adjust_ges_time = tick;
            }*/
            Ges_Log();
        }
        else if (res==GES_LEVEL2_LEFT)
        {
            LOG_DEBUG("[LEFT] adjust:%d\r\n",adjust_type);
#if(COMB_GES==0)
            HAL_GPIO_WritePin(LED_LEFT_GPIO_Port, LED_LEFT_Pin, GPIO_PIN_RESET);
            led_counter=LED_FLASH_DELAY;
#else
            Ges_Comb(GES_LEVEL2_LEFT);
#endif

            if(adjust_type != ADJUST_INIT)
            {
                if(lighting_status_now)
                    MINUS(brightness,STEP);
                comb_ges.start_adjust_ges_time = tick;
                comb_ges.gesid = 0;
            }
            /*else if(adjust_type == ADJUST_UP)
            {
                if(lighting_status_now)
                    PLUS(brightness,STEP);
                comb_ges.start_adjust_ges_time = tick;
            }*/
            Ges_Log();
        }
        else if (res==GES_LEVEL2_RIGHT)
        {
            LOG_DEBUG("[RIGHT] adjust:%d\r\n",adjust_type);
#if(COMB_GES==0)
            HAL_GPIO_WritePin(LED_RIGHT_GPIO_Port, LED_RIGHT_Pin, GPIO_PIN_RESET);
            led_counter=LED_FLASH_DELAY;
#else
            Ges_Comb(GES_LEVEL2_RIGHT);
#endif

            if(adjust_type != ADJUST_INIT)
            {
                if(lighting_status_now)
                    PLUS(brightness,STEP);
                comb_ges.start_adjust_ges_time = tick;
                comb_ges.gesid = 0;
            }
            /*else if(adjust_type == ADJUST_DOWN)
            {
                if(lighting_status_now)
                    MINUS(brightness,STEP);
                comb_ges.start_adjust_ges_time = tick;
            }*/
            Ges_Log();
        }
#if(HOLD_GES==1)
        else if (res==GES_LEVEL2_HOLD)
        {
            LOG_DEBUG("hold_flag:%d,hold_counter:%d,pwm:%d\r\n",
                 gs.hold_flag,gs.hold_counter,brightness/10);
            gs.hold_counter++;
            if (gs.hold_counter==SAMPLE_HOLD_COUNT)
            {

                gs.hold_flag = Ges_Hold_Height_Valid_Judge();
                if(gs.hold_flag)
                {
                    HAL_GPIO_WritePin(LED_LEFT_GPIO_Port, LED_LEFT_Pin, GPIO_PIN_RESET);
                    HAL_GPIO_WritePin(LED_RIGHT_GPIO_Port, LED_RIGHT_Pin, GPIO_PIN_RESET);
                    HAL_GPIO_WritePin(LED_UP_GPIO_Port, LED_UP_Pin, GPIO_PIN_RESET);
                    HAL_GPIO_WritePin(LED_DOWN_GPIO_Port, LED_DOWN_Pin, GPIO_PIN_RESET);
                    led_counter=LED_HOLD_FLASH_DELAY;
                    //Ges_Hold_Height_Judge();
                    LOG_DEBUG("[HOLD]\r\n");
                    Ges_Log();
                    //gs.hold_flag = 1;
                    gs.new_hold_AorL_size = GES_SAMPLE_RAW_ARRAY_NUM_S;
                    Ges_Calib(false);
                    //gs.ges_sample_raw_cur = 0;
                    //firstboot = true;//for next calibration when hand go away.
                    return;//the firse hold do not goto AorL Judge
                }
                else
                {
                    gs.hold_counter -= 1;
                }
            }

