85hzc/ask_433/stm32f1/Src/App.c
            if(gs.hold_flag)
            {
                Ges_Hold_Height_AorL_Judge();
                overflow_time=0;
            }

            if(gs.hold_counter>=30)
            {
                /*
                if (gs.sample_size==GES_SAMPLE_ARRAY_NUM_L)
                {
                    gs.sample_size=GES_SAMPLE_ARRAY_NUM_S;
                    gs.sample_size_raw=GES_SAMPLE_RAW_ARRAY_NUM_S;
                }*/
                gs.last_ges = GES_NULL;
                gs.hold_counter = 0;
                //gs.hold_flag = 0;
            }
        }
#endif
        /*
        else if (res==GES_LEVEL2_DCLK)
        {
            HAL_GPIO_WritePin(LED_DCLK_GPIO_Port, LED_DCLK_Pin, GPIO_PIN_RESET);
            led_counter=LED_FLASH_DELAY;
            LOG_DEBUG("                         Ges: DCLK!\r\n");
            Ges_Log();
        }
        */
        /*
        //准备接受下一手势动作
        if (gs.sample_size==GES_SAMPLE_ARRAY_NUM_L)
        {
            gs.sample_size=GES_SAMPLE_ARRAY_NUM_S;
            gs.sample_size_raw=GES_SAMPLE_RAW_ARRAY_NUM_S;
        }*/

        gs.analy_fail_counter = 0;
    }
    else
    {
        LOG_DEBUG("Ges Analysis fail.\r\n");
        /*
        //当前是long采样，改变sample_size继续采样
        if (gs.sample_size==GES_SAMPLE_ARRAY_NUM_L)
        {
            gs.sample_size=GES_SAMPLE_ARRAY_NUM_S;
            gs.sample_size_raw=GES_SAMPLE_RAW_ARRAY_NUM_S;
            return;
        }*/
        gs.last_ges = GES_NULL;
        init_counter();
        gs.analy_fail_counter++;
        if(gs.analy_fail_counter>=3)
        {
            Ges_Calib(false);
            gs.analy_fail_counter = 0;
        }
    }
#if (LOG_ENABLE)
    LOG_DEBUG("\r\n");
#endif
    //}
}
#endif
/*
//系统时钟自加
void Systick_Inc(void)
{
    __disable_irq();
    sys_tick++;
    __enable_irq();
}

//获得系统时钟
uint64_t Systick_Get(void)
{
    return sys_tick;
}
*/
